#pragma once

/*
* SDK generated by Dumper-69
*
* https://github.com/Encryqed/Dumper-69
*/

// Package: BPGLib

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Enum BPGLib.EInputMethodType
// NumValues: 0x0003
enum class EInputMethodType : uint8
{
	MouseAndKeyboard                         = 0,
	Gamepad                                  = 1,
	EInputMethodType_MAX                     = 2,
};

// Enum BPGLib.EHoverGraphArea
// NumValues: 0x0003
enum class EHoverGraphArea : uint8
{
	None                                     = 0,
	AxisName                                 = 1,
	EHoverGraphArea_MAX                      = 2,
};

// Enum BPGLib.EWidgetState
// NumValues: 0x0005
enum class EWidgetState : uint8
{
	OnShow                                   = 0,
	Idle                                     = 1,
	OnHide                                   = 2,
	Hide                                     = 3,
	EWidgetState_MAX                         = 4,
};

// Enum BPGLib.EPeriodicRepeatType
// NumValues: 0x0004
enum class EPeriodicRepeatType : uint8
{
	None                                     = 0,
	ForwardBackward                          = 1,
	LeftRight                                = 2,
	EPeriodicRepeatType_MAX                  = 3,
};

// Enum BPGLib.EMoveDriveSide
// NumValues: 0x0004
enum class EMoveDriveSide : uint8
{
	Client                                   = 0,
	Server                                   = 1,
	Remote                                   = 2,
	EMoveDriveSide_MAX                       = 3,
};

// Enum BPGLib.EMoveMode
// NumValues: 0x0006
enum class EMoveMode : uint8
{
	NoMove                                   = 0,
	Normal                                   = 1,
	RootMotion                               = 2,
	TrackMotion                              = 3,
	MotionMatchingMove                       = 4,
	EMoveMode_MAX                            = 5,
};

// Enum BPGLib.EMoveResult
// NumValues: 0x0005
enum class EMoveResult : uint8
{
	OK                                       = 0,
	HitAndSlided                             = 1,
	Stucked                                  = 2,
	ResolvedForPenetration                   = 3,
	EMoveResult_MAX                          = 4,
};

// Enum BPGLib.EPreemptiveEvent
// NumValues: 0x0004
enum class EPreemptiveEvent : uint8
{
	Start                                    = 0,
	Stepping                                 = 1,
	End                                      = 2,
	EPreemptiveEvent_MAX                     = 3,
};

// Enum BPGLib.EFadeStatus
// NumValues: 0x0005
enum class EFadeStatus : uint8
{
	None                                     = 0,
	FadingOut                                = 1,
	FadedOut                                 = 2,
	FadingIn                                 = 3,
	EFadeStatus_MAX                          = 4,
};

// Enum BPGLib.ESprintState
// NumValues: 0x0007
enum class ESprintState : uint8
{
	Deactivated                              = 0,
	StartRequest                             = 1,
	Sprinting                                = 2,
	EndRequest                               = 3,
	EndRequest_Fire                          = 4,
	EndRequest_Cancel                        = 5,
	ESprintState_MAX                         = 6,
};

// Enum BPGLib.EBPMoveDirection
// NumValues: 0x0008
enum class EBPMoveDirection : uint8
{
	NA                                       = 0,
	Forward                                  = 1,
	Left                                     = 2,
	Right                                    = 3,
	LeftForward                              = 4,
	RightForward                             = 5,
	Backward                                 = 6,
	EBPMoveDirection_MAX                     = 7,
};

// Enum BPGLib.ESprintAnimationState
// NumValues: 0x0008
enum class ESprintAnimationState : uint8
{
	NA                                       = 0,
	Start                                    = 1,
	TurnBack                                 = 2,
	Transit                                  = 3,
	FastTransit                              = 4,
	Sprinting                                = 5,
	Finish                                   = 6,
	ESprintAnimationState_MAX                = 7,
};

// Enum BPGLib.EFollowCamInitialDistance
// NumValues: 0x0005
enum class EFollowCamInitialDistance : uint8
{
	MoveToMiddleDistance                     = 0,
	AdaptiveDistance                         = 1,
	FitToTarget_Horizontal                   = 2,
	FitToTarget_Vertical                     = 3,
	EFollowCamInitialDistance_MAX            = 4,
};

// Enum BPGLib.EFollowCamMovementStyle
// NumValues: 0x0003
enum class EFollowCamMovementStyle : uint8
{
	PreferKeepingDirection                   = 0,
	PreferKeepingPosition                    = 1,
	EFollowCamMovementStyle_MAX              = 2,
};

// Enum BPGLib.EFollowCamTarget
// NumValues: 0x0004
enum class EFollowCamTarget : uint8
{
	ActorLocation                            = 0,
	ActorCenter                              = 1,
	Socket                                   = 2,
	EFollowCamTarget_MAX                     = 3,
};

// Enum BPGLib.EIndicatorType
// NumValues: 0x0006
enum class EIndicatorType : uint8
{
	Target                                   = 0,
	Ping                                     = 1,
	Stat                                     = 2,
	Revive                                   = 3,
	Scan                                     = 4,
	EIndicatorType_MAX                       = 5,
};

// Enum BPGLib.EIndicatorVisibleCondition
// NumValues: 0x0004
enum class EIndicatorVisibleCondition : uint8
{
	Always                                   = 0,
	OnSight                                  = 1,
	NotOnSight                               = 2,
	EIndicatorVisibleCondition_MAX           = 3,
};

// Enum BPGLib.ELGLevel
// NumValues: 0x0005
enum class ELGLevel : uint8
{
	Info                                     = 0,
	Debug                                    = 1,
	Warning                                  = 2,
	Error                                    = 3,
	ELGLevel_MAX                             = 4,
};

// Enum BPGLib.EWorldNetType
// NumValues: 0x0005
enum class EWorldNetType : uint8
{
	Standalone                               = 0,
	DedicatedServer                          = 1,
	ListenServer                             = 2,
	Client                                   = 3,
	EWorldNetType_MAX                        = 4,
};

// Enum BPGLib.EMessageBoxButtonType
// NumValues: 0x0004
enum class EMessageBoxButtonType : uint8
{
	Normal                                   = 0,
	Confirm                                  = 1,
	Cancel                                   = 2,
	EMessageBoxButtonType_MAX                = 3,
};

// Enum BPGLib.EMovementSourceType
// NumValues: 0x0004
enum class EMovementSourceType : uint8
{
	None                                     = 0,
	MovingFloor                              = 1,
	ImplementedInterface                     = 2,
	EMovementSourceType_MAX                  = 3,
};

// Enum BPGLib.EMsgPackFormat
// NumValues: 0x0013
enum class EMsgPackFormat : uint8
{
	NA                                       = 0,
	Nil                                      = 1,
	Map                                      = 2,
	Map_Fix                                  = 3,
	Array                                    = 4,
	Array_Fix                                = 5,
	Bool_False                               = 6,
	Bool_True                                = 7,
	Binary                                   = 8,
	Extension                                = 9,
	Extension_Fix                            = 10,
	Float                                    = 11,
	Uint                                     = 12,
	Uint_Fix                                 = 13,
	Int                                      = 14,
	Int_Fix                                  = 15,
	String                                   = 16,
	String_Fix                               = 17,
	EMsgPackFormat_MAX                       = 18,
};

// Enum BPGLib.EPopupType
// NumValues: 0x0004
enum class EPopupType : uint8
{
	GameUI                                   = 0,
	GameUI_Uncloseable                       = 1,
	SystemUI                                 = 2,
	EPopupType_MAX                           = 3,
};

// Enum BPGLib.EHandleReply
// NumValues: 0x0005
enum class EHandleReply : uint8
{
	Handled                                  = 0,
	Handled_Capture                          = 1,
	Handled_ReleaseCapture                   = 2,
	Unhandled                                = 3,
	EHandleReply_MAX                         = 4,
};

// Enum BPGLib.ESplineMeshLength
// NumValues: 0x0003
enum class ESplineMeshLength : uint8
{
	Mesh                                     = 0,
	Specified                                = 1,
	ESplineMeshLength_MAX                    = 2,
};

// Enum BPGLib.EReply
// NumValues: 0x0003
enum class EReply : uint8
{
	Unhandled                                = 0,
	Handled                                  = 1,
	EReply_MAX                               = 2,
};

// Enum BPGLib.EInputMode
// NumValues: 0x0005
enum class EInputMode : uint8
{
	Game                                     = 0,
	GameAndUI                                = 1,
	UIOnly                                   = 2,
	NoInput                                  = 3,
	EInputMode_MAX                           = 4,
};

// Enum BPGLib.EWaitingType
// NumValues: 0x0004
enum class EWaitingType : uint8
{
	NoWait                                   = 0,
	Waiting                                  = 1,
	WaitingButInteractible                   = 2,
	EWaitingType_MAX                         = 3,
};

// Enum BPGLib.EUIOrder
// NumValues: 0x0007
enum class EUIOrder : uint8
{
	Main_VeryLow                             = 0,
	Main_Low                                 = 10,
	Main_Middle                              = 20,
	Main_High                                = 30,
	Main_VeryHigh                            = 40,
	System                                   = 100,
	EUIOrder_MAX                             = 101,
};

// Enum BPGLib.EKeyModifierSide
// NumValues: 0x0004
enum class EKeyModifierSide : uint8
{
	Any                                      = 0,
	Left                                     = 1,
	Right                                    = 2,
	EKeyModifierSide_MAX                     = 3,
};

// Enum BPGLib.EUISpace
// NumValues: 0x0003
enum class EUISpace : uint8
{
	ViewportSpace                            = 0,
	UMGScreenSpace                           = 1,
	EUISpace_MAX                             = 2,
};

// Enum BPGLib.EOutlineColor
// NumValues: 0x000C
enum class EOutlineColor : uint8
{
	NotUsed                                  = 0,
	None                                     = 4,
	LightGreen                               = 12,
	LightBlue                                = 20,
	Yellow                                   = 28,
	Red                                      = 36,
	Orange                                   = 44,
	Gray                                     = 52,
	Team_Blue                                = 60,
	Team_Red                                 = 68,
	Team_Orange                              = 76,
	EOutlineColor_MAX                        = 77,
};

// Enum BPGLib.EStencilBufferType
// NumValues: 0x0003
enum class EStencilBufferType : uint8
{
	NA                                       = 0,
	SceneDepthFilter                         = 128,
	EStencilBufferType_MAX                   = 129,
};

// Enum BPGLib.ENetRoles
// NumValues: 0x0006
enum class ENetRoles : uint8
{
	NA                                       = 0,
	Server_Local                             = 1,
	Server_Remote                            = 2,
	Client_Local                             = 3,
	Client_Remote                            = 4,
	ENetRoles_MAX                            = 5,
};

// Enum BPGLib.EOptionLanguage
// NumValues: 0x000B
enum class EOptionLanguage : uint8
{
	EN                                       = 0,
	KR                                       = 1,
	JP                                       = 2,
	ZH_HANS                                  = 3,
	ZH_HANT                                  = 4,
	TH                                       = 5,
	TR                                       = 6,
	RU                                       = 7,
	PT_BR                                    = 8,
	ES_AR                                    = 9,
	EOptionLanguage_MAX                      = 10,
};

// Enum BPGLib.ECompare
// NumValues: 0x0008
enum class ECompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Greater                                  = 2,
	GreaterOrEqual                           = 3,
	Less                                     = 4,
	LessOrEqual                              = 5,
	Always                                   = 6,
	ECompare_MAX                             = 7,
};

// Enum BPGLib.ENetError
// NumValues: 0x0005
enum class ENetError : uint8
{
	NoError                                  = 0,
	Notice                                   = 1,
	Warning                                  = 2,
	CriticalError                            = 3,
	ENetError_MAX                            = 4,
};

// ScriptStruct BPGLib.LogPackBase
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FLogPackBase
{
public:
	uint8                                         Pad_1AFD[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	int32                                         TypeHash;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AFE[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FLogPackBase) == 0x000008, "Wrong alignment on FLogPackBase");
static_assert(sizeof(FLogPackBase) == 0x000010, "Wrong size on FLogPackBase");
static_assert(offsetof(FLogPackBase, TypeHash) == 0x000008, "Member 'FLogPackBase::TypeHash' has a wrong offset!");

// ScriptStruct BPGLib.LogPack
// 0x0010 (0x0020 - 0x0010)
struct FLogPack : public FLogPackBase
{
public:
	struct FDateTime                              Time;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerTime;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectID;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLogPack) == 0x000008, "Wrong alignment on FLogPack");
static_assert(sizeof(FLogPack) == 0x000020, "Wrong size on FLogPack");
static_assert(offsetof(FLogPack, Time) == 0x000010, "Member 'FLogPack::Time' has a wrong offset!");
static_assert(offsetof(FLogPack, ServerTime) == 0x000018, "Member 'FLogPack::ServerTime' has a wrong offset!");
static_assert(offsetof(FLogPack, ObjectID) == 0x00001C, "Member 'FLogPack::ObjectID' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_Base
// 0x0000 (0x0020 - 0x0020)
struct FBPGMoveLog_Base : public FLogPack
{
};
static_assert(alignof(FBPGMoveLog_Base) == 0x000008, "Wrong alignment on FBPGMoveLog_Base");
static_assert(sizeof(FBPGMoveLog_Base) == 0x000020, "Wrong size on FBPGMoveLog_Base");

// ScriptStruct BPGLib.BPGMoveLog_Warp
// 0x0048 (0x0068 - 0x0020)
struct FBPGMoveLog_Warp final : public FBPGMoveLog_Base
{
public:
	struct FVector                                Location;                                          // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Difference;                                        // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBPGMoveLog_Warp) == 0x000008, "Wrong alignment on FBPGMoveLog_Warp");
static_assert(sizeof(FBPGMoveLog_Warp) == 0x000068, "Wrong size on FBPGMoveLog_Warp");
static_assert(offsetof(FBPGMoveLog_Warp, Location) == 0x000020, "Member 'FBPGMoveLog_Warp::Location' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_Warp, Rotation) == 0x000038, "Member 'FBPGMoveLog_Warp::Rotation' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_Warp, Difference) == 0x000050, "Member 'FBPGMoveLog_Warp::Difference' has a wrong offset!");

// ScriptStruct BPGLib.MovementSourceData
// 0x0020 (0x0020 - 0x0000)
struct FMovementSourceData final
{
public:
	EMovementSourceType                           Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AFF[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class UObject*                                SourceObject;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceObjectName;                                  // 0x0010(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovementSourceData) == 0x000008, "Wrong alignment on FMovementSourceData");
static_assert(sizeof(FMovementSourceData) == 0x000020, "Wrong size on FMovementSourceData");
static_assert(offsetof(FMovementSourceData, Type) == 0x000000, "Member 'FMovementSourceData::Type' has a wrong offset!");
static_assert(offsetof(FMovementSourceData, SourceObject) == 0x000008, "Member 'FMovementSourceData::SourceObject' has a wrong offset!");
static_assert(offsetof(FMovementSourceData, SourceObjectName) == 0x000010, "Member 'FMovementSourceData::SourceObjectName' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_WastedDelta
// 0x0008 (0x0028 - 0x0020)
struct FBPGMoveLog_WastedDelta final : public FBPGMoveLog_Base
{
public:
	float                                         Delta;                                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B00[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FBPGMoveLog_WastedDelta) == 0x000008, "Wrong alignment on FBPGMoveLog_WastedDelta");
static_assert(sizeof(FBPGMoveLog_WastedDelta) == 0x000028, "Wrong size on FBPGMoveLog_WastedDelta");
static_assert(offsetof(FBPGMoveLog_WastedDelta, Delta) == 0x000020, "Member 'FBPGMoveLog_WastedDelta::Delta' has a wrong offset!");

// ScriptStruct BPGLib.BattleTime
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FBattleTime final
{
public:
	uint8                                         Pad_1B01[0x4];                                     // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FBattleTime) == 0x000004, "Wrong alignment on FBattleTime");
static_assert(sizeof(FBattleTime) == 0x000004, "Wrong size on FBattleTime");

// ScriptStruct BPGLib.DeltaTime
// 0x0002 (0x0002 - 0x0000)
struct alignas(0x02) FDeltaTime final
{
public:
	uint8                                         Pad_1B02[0x2];                                     // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FDeltaTime) == 0x000002, "Wrong alignment on FDeltaTime");
static_assert(sizeof(FDeltaTime) == 0x000002, "Wrong size on FDeltaTime");

// ScriptStruct BPGLib.MovementState
// 0x0001 (0x0001 - 0x0000)
struct FMovementState final
{
public:
	uint8                                         Pad_1B03[0x1];                                     // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FMovementState) == 0x000001, "Wrong alignment on FMovementState");
static_assert(sizeof(FMovementState) == 0x000001, "Wrong size on FMovementState");

// ScriptStruct BPGLib.C2SMove
// 0x0058 (0x0058 - 0x0000)
struct FC2SMove final
{
public:
	uint8                                         Pad_1B04[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	struct FDeltaTime                             DeltaTime;                                         // 0x0008(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementState                         MoveFlags;                                         // 0x000A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B05[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Acceleration;                                      // 0x0010(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Input;                                             // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 Yaws;                                              // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FC2SMove) == 0x000008, "Wrong alignment on FC2SMove");
static_assert(sizeof(FC2SMove) == 0x000058, "Wrong size on FC2SMove");
static_assert(offsetof(FC2SMove, DeltaTime) == 0x000008, "Member 'FC2SMove::DeltaTime' has a wrong offset!");
static_assert(offsetof(FC2SMove, MoveFlags) == 0x00000A, "Member 'FC2SMove::MoveFlags' has a wrong offset!");
static_assert(offsetof(FC2SMove, Acceleration) == 0x000010, "Member 'FC2SMove::Acceleration' has a wrong offset!");
static_assert(offsetof(FC2SMove, Input) == 0x000028, "Member 'FC2SMove::Input' has a wrong offset!");
static_assert(offsetof(FC2SMove, Pitch) == 0x000040, "Member 'FC2SMove::Pitch' has a wrong offset!");
static_assert(offsetof(FC2SMove, Roll) == 0x000044, "Member 'FC2SMove::Roll' has a wrong offset!");
static_assert(offsetof(FC2SMove, Yaws) == 0x000048, "Member 'FC2SMove::Yaws' has a wrong offset!");

// ScriptStruct BPGLib.C2SMoves
// 0x0038 (0x0038 - 0x0000)
struct FC2SMoves final
{
public:
	uint8                                         Pad_1B06[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	struct FBattleTime                            BattleTime;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B07[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<struct FC2SMove>                       Moves;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                ClientPos;                                         // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FC2SMoves) == 0x000008, "Wrong alignment on FC2SMoves");
static_assert(sizeof(FC2SMoves) == 0x000038, "Wrong size on FC2SMoves");
static_assert(offsetof(FC2SMoves, BattleTime) == 0x000008, "Member 'FC2SMoves::BattleTime' has a wrong offset!");
static_assert(offsetof(FC2SMoves, Moves) == 0x000010, "Member 'FC2SMoves::Moves' has a wrong offset!");
static_assert(offsetof(FC2SMoves, ClientPos) == 0x000020, "Member 'FC2SMoves::ClientPos' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_DriveRM_StartCorrection
// 0x0030 (0x0050 - 0x0020)
struct FBPGMoveLog_DriveRM_StartCorrection final : public FBPGMoveLog_Base
{
public:
	struct FVector                                NewStartPos;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               NewStartRot;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBPGMoveLog_DriveRM_StartCorrection) == 0x000008, "Wrong alignment on FBPGMoveLog_DriveRM_StartCorrection");
static_assert(sizeof(FBPGMoveLog_DriveRM_StartCorrection) == 0x000050, "Wrong size on FBPGMoveLog_DriveRM_StartCorrection");
static_assert(offsetof(FBPGMoveLog_DriveRM_StartCorrection, NewStartPos) == 0x000020, "Member 'FBPGMoveLog_DriveRM_StartCorrection::NewStartPos' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_DriveRM_StartCorrection, NewStartRot) == 0x000038, "Member 'FBPGMoveLog_DriveRM_StartCorrection::NewStartRot' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_OneFrame
// 0x0058 (0x0078 - 0x0020)
struct FBPGMoveLog_OneFrame final : public FBPGMoveLog_Base
{
public:
	float                                         WorldTime;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBattleTime                            BattleTime;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Pos;                                               // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rot;                                               // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementState                         Flags;                                             // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B08[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Velocity;                                          // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBPGMoveLog_OneFrame) == 0x000008, "Wrong alignment on FBPGMoveLog_OneFrame");
static_assert(sizeof(FBPGMoveLog_OneFrame) == 0x000078, "Wrong size on FBPGMoveLog_OneFrame");
static_assert(offsetof(FBPGMoveLog_OneFrame, WorldTime) == 0x000020, "Member 'FBPGMoveLog_OneFrame::WorldTime' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_OneFrame, BattleTime) == 0x000024, "Member 'FBPGMoveLog_OneFrame::BattleTime' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_OneFrame, Pos) == 0x000028, "Member 'FBPGMoveLog_OneFrame::Pos' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_OneFrame, Rot) == 0x000040, "Member 'FBPGMoveLog_OneFrame::Rot' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_OneFrame, Flags) == 0x000058, "Member 'FBPGMoveLog_OneFrame::Flags' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_OneFrame, Velocity) == 0x000060, "Member 'FBPGMoveLog_OneFrame::Velocity' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_Text
// 0x0018 (0x0038 - 0x0020)
struct FBPGMoveLog_Text final : public FBPGMoveLog_Base
{
public:
	ELGLevel                                      Level;                                             // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B09[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 Message;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBPGMoveLog_Text) == 0x000008, "Wrong alignment on FBPGMoveLog_Text");
static_assert(sizeof(FBPGMoveLog_Text) == 0x000038, "Wrong size on FBPGMoveLog_Text");
static_assert(offsetof(FBPGMoveLog_Text, Level) == 0x000020, "Member 'FBPGMoveLog_Text::Level' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_Text, Message) == 0x000028, "Member 'FBPGMoveLog_Text::Message' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_InterpAnimRot
// 0x0040 (0x0060 - 0x0020)
struct FBPGMoveLog_InterpAnimRot final : public FBPGMoveLog_Base
{
public:
	int32                                         AnimID;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayTime;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalKeys;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0A[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         ResultYaw;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0B[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 Reason;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key0_Time;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key0_Yaw;                                          // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key1_Time;                                         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Key1_Yaw;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         T;                                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0C[0x4];                                     // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FBPGMoveLog_InterpAnimRot) == 0x000008, "Wrong alignment on FBPGMoveLog_InterpAnimRot");
static_assert(sizeof(FBPGMoveLog_InterpAnimRot) == 0x000060, "Wrong size on FBPGMoveLog_InterpAnimRot");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, AnimID) == 0x000020, "Member 'FBPGMoveLog_InterpAnimRot::AnimID' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, PlayTime) == 0x000024, "Member 'FBPGMoveLog_InterpAnimRot::PlayTime' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, TotalKeys) == 0x000028, "Member 'FBPGMoveLog_InterpAnimRot::TotalKeys' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Result) == 0x00002C, "Member 'FBPGMoveLog_InterpAnimRot::Result' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, ResultYaw) == 0x000030, "Member 'FBPGMoveLog_InterpAnimRot::ResultYaw' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Reason) == 0x000038, "Member 'FBPGMoveLog_InterpAnimRot::Reason' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Key0_Time) == 0x000048, "Member 'FBPGMoveLog_InterpAnimRot::Key0_Time' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Key0_Yaw) == 0x00004C, "Member 'FBPGMoveLog_InterpAnimRot::Key0_Yaw' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Key1_Time) == 0x000050, "Member 'FBPGMoveLog_InterpAnimRot::Key1_Time' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, Key1_Yaw) == 0x000054, "Member 'FBPGMoveLog_InterpAnimRot::Key1_Yaw' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_InterpAnimRot, T) == 0x000058, "Member 'FBPGMoveLog_InterpAnimRot::T' has a wrong offset!");

// ScriptStruct BPGLib.MoveSyncID
// 0x0004 (0x0004 - 0x0000)
struct FMoveSyncID final
{
public:
	uint32                                        _id;                                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FMoveSyncID) == 0x000004, "Wrong alignment on FMoveSyncID");
static_assert(sizeof(FMoveSyncID) == 0x000004, "Wrong size on FMoveSyncID");
static_assert(offsetof(FMoveSyncID, _id) == 0x000000, "Member 'FMoveSyncID::_id' has a wrong offset!");

// ScriptStruct BPGLib.PlayingRootMotion
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FPlayingRootMotion final
{
public:
	uint8                                         Pad_1B0D[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	uint16                                        MontageID;                                         // 0x0008(0x0002)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0E[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         PlayTime;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayingRootMotion) == 0x000008, "Wrong alignment on FPlayingRootMotion");
static_assert(sizeof(FPlayingRootMotion) == 0x000010, "Wrong size on FPlayingRootMotion");
static_assert(offsetof(FPlayingRootMotion, MontageID) == 0x000008, "Member 'FPlayingRootMotion::MontageID' has a wrong offset!");
static_assert(offsetof(FPlayingRootMotion, PlayTime) == 0x00000C, "Member 'FPlayingRootMotion::PlayTime' has a wrong offset!");

// ScriptStruct BPGLib.S2CMoveAck
// 0x0070 (0x0070 - 0x0000)
struct FS2CMoveAck final
{
public:
	uint8                                         Pad_1B0F[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	struct FMoveSyncID                            SyncID;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBattleTime                            BattleTime;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B10[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FMovementSourceData                    MovementSource;                                    // 0x0030(0x0020)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FPlayingRootMotion                     PlayingRootMotion;                                 // 0x0050(0x0010)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B11[0x10];                                    // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FS2CMoveAck) == 0x000008, "Wrong alignment on FS2CMoveAck");
static_assert(sizeof(FS2CMoveAck) == 0x000070, "Wrong size on FS2CMoveAck");
static_assert(offsetof(FS2CMoveAck, SyncID) == 0x000008, "Member 'FS2CMoveAck::SyncID' has a wrong offset!");
static_assert(offsetof(FS2CMoveAck, BattleTime) == 0x00000C, "Member 'FS2CMoveAck::BattleTime' has a wrong offset!");
static_assert(offsetof(FS2CMoveAck, Position) == 0x000010, "Member 'FS2CMoveAck::Position' has a wrong offset!");
static_assert(offsetof(FS2CMoveAck, Yaw) == 0x000028, "Member 'FS2CMoveAck::Yaw' has a wrong offset!");
static_assert(offsetof(FS2CMoveAck, MovementSource) == 0x000030, "Member 'FS2CMoveAck::MovementSource' has a wrong offset!");
static_assert(offsetof(FS2CMoveAck, PlayingRootMotion) == 0x000050, "Member 'FS2CMoveAck::PlayingRootMotion' has a wrong offset!");

// ScriptStruct BPGLib.ScheduledAnimRotation
// 0x0008 (0x0008 - 0x0000)
struct FScheduledAnimRotation final
{
public:
	float                                         PlayTime;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FScheduledAnimRotation) == 0x000004, "Wrong alignment on FScheduledAnimRotation");
static_assert(sizeof(FScheduledAnimRotation) == 0x000008, "Wrong size on FScheduledAnimRotation");
static_assert(offsetof(FScheduledAnimRotation, PlayTime) == 0x000000, "Member 'FScheduledAnimRotation::PlayTime' has a wrong offset!");
static_assert(offsetof(FScheduledAnimRotation, Yaw) == 0x000004, "Member 'FScheduledAnimRotation::Yaw' has a wrong offset!");

// ScriptStruct BPGLib.MoveStamp
// 0x00A8 (0x00A8 - 0x0000)
struct FMoveStamp
{
public:
	uint8                                         Pad_1B12[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Position;                                          // 0x0008(0x0018)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMoveSyncID                            SyncID;                                            // 0x0020(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0024(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeltaTime                             Duration;                                          // 0x0028(0x0002)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B13[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	struct FBattleTime                            BattleTime;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementState                         State;                                             // 0x0030(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B14[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                InputDir;                                          // 0x0038(0x0018)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rot;                                               // 0x0050(0x0018)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementSourceData                    MovementSource;                                    // 0x0068(0x0020)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	struct FPlayingRootMotion                     PlayingRootMotion;                                 // 0x0088(0x0010)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B15[0x10];                                    // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FMoveStamp) == 0x000008, "Wrong alignment on FMoveStamp");
static_assert(sizeof(FMoveStamp) == 0x0000A8, "Wrong size on FMoveStamp");
static_assert(offsetof(FMoveStamp, Position) == 0x000008, "Member 'FMoveStamp::Position' has a wrong offset!");
static_assert(offsetof(FMoveStamp, SyncID) == 0x000020, "Member 'FMoveStamp::SyncID' has a wrong offset!");
static_assert(offsetof(FMoveStamp, Speed) == 0x000024, "Member 'FMoveStamp::Speed' has a wrong offset!");
static_assert(offsetof(FMoveStamp, Duration) == 0x000028, "Member 'FMoveStamp::Duration' has a wrong offset!");
static_assert(offsetof(FMoveStamp, BattleTime) == 0x00002C, "Member 'FMoveStamp::BattleTime' has a wrong offset!");
static_assert(offsetof(FMoveStamp, State) == 0x000030, "Member 'FMoveStamp::State' has a wrong offset!");
static_assert(offsetof(FMoveStamp, InputDir) == 0x000038, "Member 'FMoveStamp::InputDir' has a wrong offset!");
static_assert(offsetof(FMoveStamp, Rot) == 0x000050, "Member 'FMoveStamp::Rot' has a wrong offset!");
static_assert(offsetof(FMoveStamp, MovementSource) == 0x000068, "Member 'FMoveStamp::MovementSource' has a wrong offset!");
static_assert(offsetof(FMoveStamp, PlayingRootMotion) == 0x000088, "Member 'FMoveStamp::PlayingRootMotion' has a wrong offset!");

// ScriptStruct BPGLib.AnimTrackKey
// 0x0040 (0x0040 - 0x0000)
struct FAnimTrackKey final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B16[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Pos;                                               // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Rot;                                               // 0x0020(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimTrackKey) == 0x000010, "Wrong alignment on FAnimTrackKey");
static_assert(sizeof(FAnimTrackKey) == 0x000040, "Wrong size on FAnimTrackKey");
static_assert(offsetof(FAnimTrackKey, Time) == 0x000000, "Member 'FAnimTrackKey::Time' has a wrong offset!");
static_assert(offsetof(FAnimTrackKey, Pos) == 0x000008, "Member 'FAnimTrackKey::Pos' has a wrong offset!");
static_assert(offsetof(FAnimTrackKey, Rot) == 0x000020, "Member 'FAnimTrackKey::Rot' has a wrong offset!");

// ScriptStruct BPGLib.MoveStampC2S
// 0x0000 (0x00A8 - 0x00A8)
struct FMoveStampC2S final : public FMoveStamp
{
};
static_assert(alignof(FMoveStampC2S) == 0x000008, "Wrong alignment on FMoveStampC2S");
static_assert(sizeof(FMoveStampC2S) == 0x0000A8, "Wrong size on FMoveStampC2S");

// ScriptStruct BPGLib.UUID
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FUUID final
{
public:
	uint8                                         Pad_1B17[0x10];                                    // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FUUID) == 0x000004, "Wrong alignment on FUUID");
static_assert(sizeof(FUUID) == 0x000010, "Wrong size on FUUID");

// ScriptStruct BPGLib.SprintParams
// 0x0004 (0x0004 - 0x0000)
struct FSprintParams final
{
public:
	ESprintState                                  State;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBPMoveDirection                              Prev;                                              // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBPMoveDirection                              Next;                                              // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESprintAnimationState                         AnimState;                                         // 0x0003(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSprintParams) == 0x000001, "Wrong alignment on FSprintParams");
static_assert(sizeof(FSprintParams) == 0x000004, "Wrong size on FSprintParams");
static_assert(offsetof(FSprintParams, State) == 0x000000, "Member 'FSprintParams::State' has a wrong offset!");
static_assert(offsetof(FSprintParams, Prev) == 0x000001, "Member 'FSprintParams::Prev' has a wrong offset!");
static_assert(offsetof(FSprintParams, Next) == 0x000002, "Member 'FSprintParams::Next' has a wrong offset!");
static_assert(offsetof(FSprintParams, AnimState) == 0x000003, "Member 'FSprintParams::AnimState' has a wrong offset!");

// ScriptStruct BPGLib.StartingRootMotion
// 0x0028 (0x0028 - 0x0000)
struct FStartingRootMotion final
{
public:
	uint16                                        AnimID;                                            // 0x0000(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B18[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B19[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FStartingRootMotion) == 0x000008, "Wrong alignment on FStartingRootMotion");
static_assert(sizeof(FStartingRootMotion) == 0x000028, "Wrong size on FStartingRootMotion");
static_assert(offsetof(FStartingRootMotion, AnimID) == 0x000000, "Member 'FStartingRootMotion::AnimID' has a wrong offset!");
static_assert(offsetof(FStartingRootMotion, StartTime) == 0x000004, "Member 'FStartingRootMotion::StartTime' has a wrong offset!");
static_assert(offsetof(FStartingRootMotion, Location) == 0x000008, "Member 'FStartingRootMotion::Location' has a wrong offset!");
static_assert(offsetof(FStartingRootMotion, Yaw) == 0x000020, "Member 'FStartingRootMotion::Yaw' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_ErrorCorrection
// 0x0068 (0x0088 - 0x0020)
struct FBPGMoveLog_ErrorCorrection final : public FBPGMoveLog_Base
{
public:
	class FString                                 Text;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoveMode                                     MoveMode;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1A[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                CurPos;                                            // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CurRot;                                            // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ErrorPos;                                          // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ErrorYaw;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1B[0x4];                                     // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(FBPGMoveLog_ErrorCorrection) == 0x000008, "Wrong alignment on FBPGMoveLog_ErrorCorrection");
static_assert(sizeof(FBPGMoveLog_ErrorCorrection) == 0x000088, "Wrong size on FBPGMoveLog_ErrorCorrection");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, Text) == 0x000020, "Member 'FBPGMoveLog_ErrorCorrection::Text' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, MoveMode) == 0x000030, "Member 'FBPGMoveLog_ErrorCorrection::MoveMode' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, CurPos) == 0x000038, "Member 'FBPGMoveLog_ErrorCorrection::CurPos' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, CurRot) == 0x000050, "Member 'FBPGMoveLog_ErrorCorrection::CurRot' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, ErrorPos) == 0x000068, "Member 'FBPGMoveLog_ErrorCorrection::ErrorPos' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ErrorCorrection, ErrorYaw) == 0x000080, "Member 'FBPGMoveLog_ErrorCorrection::ErrorYaw' has a wrong offset!");

// ScriptStruct BPGLib.BPGMoveLog_ServerDrive_Wasted
// 0x0028 (0x0048 - 0x0020)
struct FBPGMoveLog_ServerDrive_Wasted final : public FBPGMoveLog_Base
{
public:
	float                                         DeltaTime;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedTime;                                       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1C[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Acceleration;                                      // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBPGMoveLog_ServerDrive_Wasted) == 0x000008, "Wrong alignment on FBPGMoveLog_ServerDrive_Wasted");
static_assert(sizeof(FBPGMoveLog_ServerDrive_Wasted) == 0x000048, "Wrong size on FBPGMoveLog_ServerDrive_Wasted");
static_assert(offsetof(FBPGMoveLog_ServerDrive_Wasted, DeltaTime) == 0x000020, "Member 'FBPGMoveLog_ServerDrive_Wasted::DeltaTime' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ServerDrive_Wasted, ElapsedTime) == 0x000024, "Member 'FBPGMoveLog_ServerDrive_Wasted::ElapsedTime' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ServerDrive_Wasted, Alpha) == 0x000028, "Member 'FBPGMoveLog_ServerDrive_Wasted::Alpha' has a wrong offset!");
static_assert(offsetof(FBPGMoveLog_ServerDrive_Wasted, Acceleration) == 0x000030, "Member 'FBPGMoveLog_ServerDrive_Wasted::Acceleration' has a wrong offset!");

// ScriptStruct BPGLib.MovementProfile
// 0x0014 (0x0014 - 0x0000)
struct FMovementProfile final
{
public:
	float                                         MaxSpeed;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAcceleration;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableFullAcceleration;                            // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         Friction;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BrakingDeceleration;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovementProfile) == 0x000004, "Wrong alignment on FMovementProfile");
static_assert(sizeof(FMovementProfile) == 0x000014, "Wrong size on FMovementProfile");
static_assert(offsetof(FMovementProfile, MaxSpeed) == 0x000000, "Member 'FMovementProfile::MaxSpeed' has a wrong offset!");
static_assert(offsetof(FMovementProfile, MaxAcceleration) == 0x000004, "Member 'FMovementProfile::MaxAcceleration' has a wrong offset!");
static_assert(offsetof(FMovementProfile, EnableFullAcceleration) == 0x000008, "Member 'FMovementProfile::EnableFullAcceleration' has a wrong offset!");
static_assert(offsetof(FMovementProfile, Friction) == 0x00000C, "Member 'FMovementProfile::Friction' has a wrong offset!");
static_assert(offsetof(FMovementProfile, BrakingDeceleration) == 0x000010, "Member 'FMovementProfile::BrakingDeceleration' has a wrong offset!");

// ScriptStruct BPGLib.LocomotiveProfile
// 0x0060 (0x0060 - 0x0000)
struct FLocomotiveProfile final
{
public:
	struct FMovementProfile                       Forward;                                           // 0x0000(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementProfile                       Side;                                              // 0x0014(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovementProfile                       Backward;                                          // 0x0028(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1E[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FVector                                Gravity;                                           // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale;                                      // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B1F[0x4];                                     // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
