#pragma once

/*
* SDK generated by Dumper-69
*
* https://github.com/Encryqed/Dumper-69
*/

// Package: BPGLib

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "BPGLib_structs.hpp"


namespace SDK::Params
{

// Function BPGLib.3DViewWidget.GetActor
// 0x0008 (0x0008 - 0x0000)
struct ThreeDViewWidget_GetActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetActor) == 0x000008, "Wrong alignment on ThreeDViewWidget_GetActor");
static_assert(sizeof(ThreeDViewWidget_GetActor) == 0x000008, "Wrong size on ThreeDViewWidget_GetActor");
static_assert(offsetof(ThreeDViewWidget_GetActor, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetActor::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetCameraLocation
// 0x0018 (0x0018 - 0x0000)
struct ThreeDViewWidget_GetCameraLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetCameraLocation) == 0x000008, "Wrong alignment on ThreeDViewWidget_GetCameraLocation");
static_assert(sizeof(ThreeDViewWidget_GetCameraLocation) == 0x000018, "Wrong size on ThreeDViewWidget_GetCameraLocation");
static_assert(offsetof(ThreeDViewWidget_GetCameraLocation, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetCameraLocation::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct ThreeDViewWidget_GetCameraRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetCameraRotation) == 0x000008, "Wrong alignment on ThreeDViewWidget_GetCameraRotation");
static_assert(sizeof(ThreeDViewWidget_GetCameraRotation) == 0x000018, "Wrong size on ThreeDViewWidget_GetCameraRotation");
static_assert(offsetof(ThreeDViewWidget_GetCameraRotation, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetCameraRotation::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetCaptureSource
// 0x0001 (0x0001 - 0x0000)
struct ThreeDViewWidget_GetCaptureSource final
{
public:
	ESceneCaptureSource                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetCaptureSource) == 0x000001, "Wrong alignment on ThreeDViewWidget_GetCaptureSource");
static_assert(sizeof(ThreeDViewWidget_GetCaptureSource) == 0x000001, "Wrong size on ThreeDViewWidget_GetCaptureSource");
static_assert(offsetof(ThreeDViewWidget_GetCaptureSource, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetCaptureSource::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetClearColor
// 0x0010 (0x0010 - 0x0000)
struct ThreeDViewWidget_GetClearColor final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetClearColor) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetClearColor");
static_assert(sizeof(ThreeDViewWidget_GetClearColor) == 0x000010, "Wrong size on ThreeDViewWidget_GetClearColor");
static_assert(offsetof(ThreeDViewWidget_GetClearColor, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetClearColor::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetFOV
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetFOV final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetFOV) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetFOV");
static_assert(sizeof(ThreeDViewWidget_GetFOV) == 0x000004, "Wrong size on ThreeDViewWidget_GetFOV");
static_assert(offsetof(ThreeDViewWidget_GetFOV, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetFOV::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetMaxDepth
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetMaxDepth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetMaxDepth) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetMaxDepth");
static_assert(sizeof(ThreeDViewWidget_GetMaxDepth) == 0x000004, "Wrong size on ThreeDViewWidget_GetMaxDepth");
static_assert(offsetof(ThreeDViewWidget_GetMaxDepth, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetMaxDepth::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetMinDepth
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetMinDepth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetMinDepth) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetMinDepth");
static_assert(sizeof(ThreeDViewWidget_GetMinDepth) == 0x000004, "Wrong size on ThreeDViewWidget_GetMinDepth");
static_assert(offsetof(ThreeDViewWidget_GetMinDepth, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetMinDepth::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetOrthoWidth
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetOrthoWidth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetOrthoWidth) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetOrthoWidth");
static_assert(sizeof(ThreeDViewWidget_GetOrthoWidth) == 0x000004, "Wrong size on ThreeDViewWidget_GetOrthoWidth");
static_assert(offsetof(ThreeDViewWidget_GetOrthoWidth, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetOrthoWidth::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetPostProcessSettings
// 0x06E0 (0x06E0 - 0x0000)
struct ThreeDViewWidget_GetPostProcessSettings final
{
public:
	struct FPostProcessSettings                   ReturnValue;                                       // 0x0000(0x06E0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetPostProcessSettings) == 0x000010, "Wrong alignment on ThreeDViewWidget_GetPostProcessSettings");
static_assert(sizeof(ThreeDViewWidget_GetPostProcessSettings) == 0x0006E0, "Wrong size on ThreeDViewWidget_GetPostProcessSettings");
static_assert(offsetof(ThreeDViewWidget_GetPostProcessSettings, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetPostProcessSettings::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetProjectionMode
// 0x0001 (0x0001 - 0x0000)
struct ThreeDViewWidget_GetProjectionMode final
{
public:
	ECameraProjectionMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetProjectionMode) == 0x000001, "Wrong alignment on ThreeDViewWidget_GetProjectionMode");
static_assert(sizeof(ThreeDViewWidget_GetProjectionMode) == 0x000001, "Wrong size on ThreeDViewWidget_GetProjectionMode");
static_assert(offsetof(ThreeDViewWidget_GetProjectionMode, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetProjectionMode::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetRenderTargetFormat
// 0x0001 (0x0001 - 0x0000)
struct ThreeDViewWidget_GetRenderTargetFormat final
{
public:
	ETextureRenderTargetFormat                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetRenderTargetFormat) == 0x000001, "Wrong alignment on ThreeDViewWidget_GetRenderTargetFormat");
static_assert(sizeof(ThreeDViewWidget_GetRenderTargetFormat) == 0x000001, "Wrong size on ThreeDViewWidget_GetRenderTargetFormat");
static_assert(offsetof(ThreeDViewWidget_GetRenderTargetFormat, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetRenderTargetFormat::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetRenderTargetHeight
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetRenderTargetHeight final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetRenderTargetHeight) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetRenderTargetHeight");
static_assert(sizeof(ThreeDViewWidget_GetRenderTargetHeight) == 0x000004, "Wrong size on ThreeDViewWidget_GetRenderTargetHeight");
static_assert(offsetof(ThreeDViewWidget_GetRenderTargetHeight, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetRenderTargetHeight::ReturnValue' has a wrong offset!");

// Function BPGLib.3DViewWidget.GetRenderTargetWidth
// 0x0004 (0x0004 - 0x0000)
struct ThreeDViewWidget_GetRenderTargetWidth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ThreeDViewWidget_GetRenderTargetWidth) == 0x000004, "Wrong alignment on ThreeDViewWidget_GetRenderTargetWidth");
static_assert(sizeof(ThreeDViewWidget_GetRenderTargetWidth) == 0x000004, "Wrong size on ThreeDViewWidget_GetRenderTargetWidth");
static_assert(offsetof(ThreeDViewWidget_GetRenderTargetWidth, ReturnValue) == 0x000000, "Member 'ThreeDViewWidget_GetRenderTargetWidth::ReturnValue' has a wrong offset!");

// Function BPGLib.AnimatableWidget.CloseWithAnim
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_CloseWithAnim final
{
public:
	bool                                          _force_immediately;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_CloseWithAnim) == 0x000001, "Wrong alignment on AnimatableWidget_CloseWithAnim");
static_assert(sizeof(AnimatableWidget_CloseWithAnim) == 0x000001, "Wrong size on AnimatableWidget_CloseWithAnim");
static_assert(offsetof(AnimatableWidget_CloseWithAnim, _force_immediately) == 0x000000, "Member 'AnimatableWidget_CloseWithAnim::_force_immediately' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Focus
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_OnEVENT_Focus final
{
public:
	bool                                          _focus;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Focus) == 0x000001, "Wrong alignment on AnimatableWidget_OnEVENT_Focus");
static_assert(sizeof(AnimatableWidget_OnEVENT_Focus) == 0x000001, "Wrong size on AnimatableWidget_OnEVENT_Focus");
static_assert(offsetof(AnimatableWidget_OnEVENT_Focus, _focus) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Focus::_focus' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Focus_Internal
// 0x0010 (0x0010 - 0x0000)
struct AnimatableWidget_OnEVENT_Focus_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _focus;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B6D[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(AnimatableWidget_OnEVENT_Focus_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Focus_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Focus_Internal) == 0x000010, "Wrong size on AnimatableWidget_OnEVENT_Focus_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Focus_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Focus_Internal::_self' has a wrong offset!");
static_assert(offsetof(AnimatableWidget_OnEVENT_Focus_Internal, _focus) == 0x000008, "Member 'AnimatableWidget_OnEVENT_Focus_Internal::_focus' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Hide_End_Internal
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_OnEVENT_Hide_End_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Hide_End_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Hide_End_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Hide_End_Internal) == 0x000008, "Wrong size on AnimatableWidget_OnEVENT_Hide_End_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Hide_End_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Hide_End_Internal::_self' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Hide_Start_Internal
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_OnEVENT_Hide_Start_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Hide_Start_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Hide_Start_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Hide_Start_Internal) == 0x000008, "Wrong size on AnimatableWidget_OnEVENT_Hide_Start_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Hide_Start_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Hide_Start_Internal::_self' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Select_End
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_OnEVENT_Select_End final
{
public:
	bool                                          _selected;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Select_End) == 0x000001, "Wrong alignment on AnimatableWidget_OnEVENT_Select_End");
static_assert(sizeof(AnimatableWidget_OnEVENT_Select_End) == 0x000001, "Wrong size on AnimatableWidget_OnEVENT_Select_End");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_End, _selected) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Select_End::_selected' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Select_End_Internal
// 0x0010 (0x0010 - 0x0000)
struct AnimatableWidget_OnEVENT_Select_End_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _select;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B6E[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(AnimatableWidget_OnEVENT_Select_End_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Select_End_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Select_End_Internal) == 0x000010, "Wrong size on AnimatableWidget_OnEVENT_Select_End_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_End_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Select_End_Internal::_self' has a wrong offset!");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_End_Internal, _select) == 0x000008, "Member 'AnimatableWidget_OnEVENT_Select_End_Internal::_select' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Select_Start
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_OnEVENT_Select_Start final
{
public:
	bool                                          _select;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Select_Start) == 0x000001, "Wrong alignment on AnimatableWidget_OnEVENT_Select_Start");
static_assert(sizeof(AnimatableWidget_OnEVENT_Select_Start) == 0x000001, "Wrong size on AnimatableWidget_OnEVENT_Select_Start");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_Start, _select) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Select_Start::_select' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Select_Start_Internal
// 0x0010 (0x0010 - 0x0000)
struct AnimatableWidget_OnEVENT_Select_Start_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _select;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B6F[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(AnimatableWidget_OnEVENT_Select_Start_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Select_Start_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Select_Start_Internal) == 0x000010, "Wrong size on AnimatableWidget_OnEVENT_Select_Start_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_Start_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Select_Start_Internal::_self' has a wrong offset!");
static_assert(offsetof(AnimatableWidget_OnEVENT_Select_Start_Internal, _select) == 0x000008, "Member 'AnimatableWidget_OnEVENT_Select_Start_Internal::_select' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Show_End_Internal
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_OnEVENT_Show_End_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Show_End_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Show_End_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Show_End_Internal) == 0x000008, "Wrong size on AnimatableWidget_OnEVENT_Show_End_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Show_End_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Show_End_Internal::_self' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Show_Start_Internal
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_OnEVENT_Show_Start_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Show_Start_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Show_Start_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Show_Start_Internal) == 0x000008, "Wrong size on AnimatableWidget_OnEVENT_Show_Start_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Show_Start_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Show_Start_Internal::_self' has a wrong offset!");

// Function BPGLib.AnimatableWidget.OnEVENT_Spotlight_Internal
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_OnEVENT_Spotlight_Internal final
{
public:
	class UAnimatableWidget*                      _self;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_OnEVENT_Spotlight_Internal) == 0x000008, "Wrong alignment on AnimatableWidget_OnEVENT_Spotlight_Internal");
static_assert(sizeof(AnimatableWidget_OnEVENT_Spotlight_Internal) == 0x000008, "Wrong size on AnimatableWidget_OnEVENT_Spotlight_Internal");
static_assert(offsetof(AnimatableWidget_OnEVENT_Spotlight_Internal, _self) == 0x000000, "Member 'AnimatableWidget_OnEVENT_Spotlight_Internal::_self' has a wrong offset!");

// Function BPGLib.AnimatableWidget.Select
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_Select final
{
public:
	bool                                          _select;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_Select) == 0x000001, "Wrong alignment on AnimatableWidget_Select");
static_assert(sizeof(AnimatableWidget_Select) == 0x000001, "Wrong size on AnimatableWidget_Select");
static_assert(offsetof(AnimatableWidget_Select, _select) == 0x000000, "Member 'AnimatableWidget_Select::_select' has a wrong offset!");

// Function BPGLib.AnimatableWidget.SetVisibilityWithAnim
// 0x0002 (0x0002 - 0x0000)
struct AnimatableWidget_SetVisibilityWithAnim final
{
public:
	ESlateVisibility                              _visibility;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _force_immediately;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_SetVisibilityWithAnim) == 0x000001, "Wrong alignment on AnimatableWidget_SetVisibilityWithAnim");
static_assert(sizeof(AnimatableWidget_SetVisibilityWithAnim) == 0x000002, "Wrong size on AnimatableWidget_SetVisibilityWithAnim");
static_assert(offsetof(AnimatableWidget_SetVisibilityWithAnim, _visibility) == 0x000000, "Member 'AnimatableWidget_SetVisibilityWithAnim::_visibility' has a wrong offset!");
static_assert(offsetof(AnimatableWidget_SetVisibilityWithAnim, _force_immediately) == 0x000001, "Member 'AnimatableWidget_SetVisibilityWithAnim::_force_immediately' has a wrong offset!");

// Function BPGLib.AnimatableWidget.SkipPlayAnimation
// 0x0008 (0x0008 - 0x0000)
struct AnimatableWidget_SkipPlayAnimation final
{
public:
	class FName                                   _anim_name;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_SkipPlayAnimation) == 0x000004, "Wrong alignment on AnimatableWidget_SkipPlayAnimation");
static_assert(sizeof(AnimatableWidget_SkipPlayAnimation) == 0x000008, "Wrong size on AnimatableWidget_SkipPlayAnimation");
static_assert(offsetof(AnimatableWidget_SkipPlayAnimation, _anim_name) == 0x000000, "Member 'AnimatableWidget_SkipPlayAnimation::_anim_name' has a wrong offset!");

// Function BPGLib.AnimatableWidget.IsFocused
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_IsFocused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_IsFocused) == 0x000001, "Wrong alignment on AnimatableWidget_IsFocused");
static_assert(sizeof(AnimatableWidget_IsFocused) == 0x000001, "Wrong size on AnimatableWidget_IsFocused");
static_assert(offsetof(AnimatableWidget_IsFocused, ReturnValue) == 0x000000, "Member 'AnimatableWidget_IsFocused::ReturnValue' has a wrong offset!");

// Function BPGLib.AnimatableWidget.IsSelected
// 0x0001 (0x0001 - 0x0000)
struct AnimatableWidget_IsSelected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimatableWidget_IsSelected) == 0x000001, "Wrong alignment on AnimatableWidget_IsSelected");
static_assert(sizeof(AnimatableWidget_IsSelected) == 0x000001, "Wrong size on AnimatableWidget_IsSelected");
static_assert(offsetof(AnimatableWidget_IsSelected, ReturnValue) == 0x000000, "Member 'AnimatableWidget_IsSelected::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.GetCurrentMovementSource
// 0x0008 (0x0008 - 0x0000)
struct BPGCharacter_GetCurrentMovementSource final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_GetCurrentMovementSource) == 0x000008, "Wrong alignment on BPGCharacter_GetCurrentMovementSource");
static_assert(sizeof(BPGCharacter_GetCurrentMovementSource) == 0x000008, "Wrong size on BPGCharacter_GetCurrentMovementSource");
static_assert(offsetof(BPGCharacter_GetCurrentMovementSource, ReturnValue) == 0x000000, "Member 'BPGCharacter_GetCurrentMovementSource::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.RPC_C2S_Moves
// 0x0038 (0x0038 - 0x0000)
struct BPGCharacter_RPC_C2S_Moves final
{
public:
	struct FC2SMoves                              _moves;                                            // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_RPC_C2S_Moves) == 0x000008, "Wrong alignment on BPGCharacter_RPC_C2S_Moves");
static_assert(sizeof(BPGCharacter_RPC_C2S_Moves) == 0x000038, "Wrong size on BPGCharacter_RPC_C2S_Moves");
static_assert(offsetof(BPGCharacter_RPC_C2S_Moves, _moves) == 0x000000, "Member 'BPGCharacter_RPC_C2S_Moves::_moves' has a wrong offset!");

// Function BPGLib.BPGCharacter.RPC_S2C_ForcedMoveAck
// 0x0070 (0x0070 - 0x0000)
struct BPGCharacter_RPC_S2C_ForcedMoveAck final
{
public:
	struct FS2CMoveAck                            _ack;                                              // 0x0000(0x0070)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_RPC_S2C_ForcedMoveAck) == 0x000008, "Wrong alignment on BPGCharacter_RPC_S2C_ForcedMoveAck");
static_assert(sizeof(BPGCharacter_RPC_S2C_ForcedMoveAck) == 0x000070, "Wrong size on BPGCharacter_RPC_S2C_ForcedMoveAck");
static_assert(offsetof(BPGCharacter_RPC_S2C_ForcedMoveAck, _ack) == 0x000000, "Member 'BPGCharacter_RPC_S2C_ForcedMoveAck::_ack' has a wrong offset!");

// Function BPGLib.BPGCharacter.RPC_S2C_MoveAck
// 0x0070 (0x0070 - 0x0000)
struct BPGCharacter_RPC_S2C_MoveAck final
{
public:
	struct FS2CMoveAck                            _ack;                                              // 0x0000(0x0070)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_RPC_S2C_MoveAck) == 0x000008, "Wrong alignment on BPGCharacter_RPC_S2C_MoveAck");
static_assert(sizeof(BPGCharacter_RPC_S2C_MoveAck) == 0x000070, "Wrong size on BPGCharacter_RPC_S2C_MoveAck");
static_assert(offsetof(BPGCharacter_RPC_S2C_MoveAck, _ack) == 0x000000, "Member 'BPGCharacter_RPC_S2C_MoveAck::_ack' has a wrong offset!");

// Function BPGLib.BPGCharacter.RPC_SERVER_MoveStamp
// 0x00A8 (0x00A8 - 0x0000)
struct BPGCharacter_RPC_SERVER_MoveStamp final
{
public:
	struct FMoveStampC2S                          _move;                                             // 0x0000(0x00A8)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_RPC_SERVER_MoveStamp) == 0x000008, "Wrong alignment on BPGCharacter_RPC_SERVER_MoveStamp");
static_assert(sizeof(BPGCharacter_RPC_SERVER_MoveStamp) == 0x0000A8, "Wrong size on BPGCharacter_RPC_SERVER_MoveStamp");
static_assert(offsetof(BPGCharacter_RPC_SERVER_MoveStamp, _move) == 0x000000, "Member 'BPGCharacter_RPC_SERVER_MoveStamp::_move' has a wrong offset!");

// Function BPGLib.BPGCharacter.RPC_SERVER_Request_ChangeSprintState
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_RPC_SERVER_Request_ChangeSprintState final
{
public:
	ESprintState                                  _state;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_RPC_SERVER_Request_ChangeSprintState) == 0x000001, "Wrong alignment on BPGCharacter_RPC_SERVER_Request_ChangeSprintState");
static_assert(sizeof(BPGCharacter_RPC_SERVER_Request_ChangeSprintState) == 0x000001, "Wrong size on BPGCharacter_RPC_SERVER_Request_ChangeSprintState");
static_assert(offsetof(BPGCharacter_RPC_SERVER_Request_ChangeSprintState, _state) == 0x000000, "Member 'BPGCharacter_RPC_SERVER_Request_ChangeSprintState::_state' has a wrong offset!");

// Function BPGLib.BPGCharacter.SetMovementScaler
// 0x0018 (0x0018 - 0x0000)
struct BPGCharacter_SetMovementScaler final
{
public:
	struct FVector                                _scaler;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_SetMovementScaler) == 0x000008, "Wrong alignment on BPGCharacter_SetMovementScaler");
static_assert(sizeof(BPGCharacter_SetMovementScaler) == 0x000018, "Wrong size on BPGCharacter_SetMovementScaler");
static_assert(offsetof(BPGCharacter_SetMovementScaler, _scaler) == 0x000000, "Member 'BPGCharacter_SetMovementScaler::_scaler' has a wrong offset!");

// Function BPGLib.BPGCharacter.SetMovementSource
// 0x0008 (0x0008 - 0x0000)
struct BPGCharacter_SetMovementSource final
{
public:
	class UObject*                                _source;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_SetMovementSource) == 0x000008, "Wrong alignment on BPGCharacter_SetMovementSource");
static_assert(sizeof(BPGCharacter_SetMovementSource) == 0x000008, "Wrong size on BPGCharacter_SetMovementSource");
static_assert(offsetof(BPGCharacter_SetMovementSource, _source) == 0x000000, "Member 'BPGCharacter_SetMovementSource::_source' has a wrong offset!");

// Function BPGLib.BPGCharacter.SetMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_SetMoveMode final
{
public:
	EMoveMode                                     _mode;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_SetMoveMode) == 0x000001, "Wrong alignment on BPGCharacter_SetMoveMode");
static_assert(sizeof(BPGCharacter_SetMoveMode) == 0x000001, "Wrong size on BPGCharacter_SetMoveMode");
static_assert(offsetof(BPGCharacter_SetMoveMode, _mode) == 0x000000, "Member 'BPGCharacter_SetMoveMode::_mode' has a wrong offset!");

// Function BPGLib.BPGCharacter.SetPlayingLocoMotionNode
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_SetPlayingLocoMotionNode final
{
public:
	bool                                          _is_playing;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_SetPlayingLocoMotionNode) == 0x000001, "Wrong alignment on BPGCharacter_SetPlayingLocoMotionNode");
static_assert(sizeof(BPGCharacter_SetPlayingLocoMotionNode) == 0x000001, "Wrong size on BPGCharacter_SetPlayingLocoMotionNode");
static_assert(offsetof(BPGCharacter_SetPlayingLocoMotionNode, _is_playing) == 0x000000, "Member 'BPGCharacter_SetPlayingLocoMotionNode::_is_playing' has a wrong offset!");

// Function BPGLib.BPGCharacter.SetRotationScaler
// 0x0018 (0x0018 - 0x0000)
struct BPGCharacter_SetRotationScaler final
{
public:
	struct FRotator                               _scaler;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_SetRotationScaler) == 0x000008, "Wrong alignment on BPGCharacter_SetRotationScaler");
static_assert(sizeof(BPGCharacter_SetRotationScaler) == 0x000018, "Wrong size on BPGCharacter_SetRotationScaler");
static_assert(offsetof(BPGCharacter_SetRotationScaler, _scaler) == 0x000000, "Member 'BPGCharacter_SetRotationScaler::_scaler' has a wrong offset!");

// Function BPGLib.BPGCharacter.GetMovementScaler
// 0x0018 (0x0018 - 0x0000)
struct BPGCharacter_GetMovementScaler final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_GetMovementScaler) == 0x000008, "Wrong alignment on BPGCharacter_GetMovementScaler");
static_assert(sizeof(BPGCharacter_GetMovementScaler) == 0x000018, "Wrong size on BPGCharacter_GetMovementScaler");
static_assert(offsetof(BPGCharacter_GetMovementScaler, ReturnValue) == 0x000000, "Member 'BPGCharacter_GetMovementScaler::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.GetMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_GetMoveMode final
{
public:
	EMoveMode                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_GetMoveMode) == 0x000001, "Wrong alignment on BPGCharacter_GetMoveMode");
static_assert(sizeof(BPGCharacter_GetMoveMode) == 0x000001, "Wrong size on BPGCharacter_GetMoveMode");
static_assert(offsetof(BPGCharacter_GetMoveMode, ReturnValue) == 0x000000, "Member 'BPGCharacter_GetMoveMode::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.GetRotationScaler
// 0x0018 (0x0018 - 0x0000)
struct BPGCharacter_GetRotationScaler final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_GetRotationScaler) == 0x000008, "Wrong alignment on BPGCharacter_GetRotationScaler");
static_assert(sizeof(BPGCharacter_GetRotationScaler) == 0x000018, "Wrong size on BPGCharacter_GetRotationScaler");
static_assert(offsetof(BPGCharacter_GetRotationScaler, ReturnValue) == 0x000000, "Member 'BPGCharacter_GetRotationScaler::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.IsLocal
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_IsLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_IsLocal) == 0x000001, "Wrong alignment on BPGCharacter_IsLocal");
static_assert(sizeof(BPGCharacter_IsLocal) == 0x000001, "Wrong size on BPGCharacter_IsLocal");
static_assert(offsetof(BPGCharacter_IsLocal, ReturnValue) == 0x000000, "Member 'BPGCharacter_IsLocal::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.IsPlayingLocoMotionNode
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_IsPlayingLocoMotionNode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_IsPlayingLocoMotionNode) == 0x000001, "Wrong alignment on BPGCharacter_IsPlayingLocoMotionNode");
static_assert(sizeof(BPGCharacter_IsPlayingLocoMotionNode) == 0x000001, "Wrong size on BPGCharacter_IsPlayingLocoMotionNode");
static_assert(offsetof(BPGCharacter_IsPlayingLocoMotionNode, ReturnValue) == 0x000000, "Member 'BPGCharacter_IsPlayingLocoMotionNode::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.IsRemote
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_IsRemote final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_IsRemote) == 0x000001, "Wrong alignment on BPGCharacter_IsRemote");
static_assert(sizeof(BPGCharacter_IsRemote) == 0x000001, "Wrong size on BPGCharacter_IsRemote");
static_assert(offsetof(BPGCharacter_IsRemote, ReturnValue) == 0x000000, "Member 'BPGCharacter_IsRemote::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGCharacter.IsSpectated
// 0x0001 (0x0001 - 0x0000)
struct BPGCharacter_IsSpectated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGCharacter_IsSpectated) == 0x000001, "Wrong alignment on BPGCharacter_IsSpectated");
static_assert(sizeof(BPGCharacter_IsSpectated) == 0x000001, "Wrong size on BPGCharacter_IsSpectated");
static_assert(offsetof(BPGCharacter_IsSpectated, ReturnValue) == 0x000000, "Member 'BPGCharacter_IsSpectated::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGGameInstance.GetVersion
// 0x0010 (0x0010 - 0x0000)
struct BPGGameInstance_GetVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGGameInstance_GetVersion) == 0x000008, "Wrong alignment on BPGGameInstance_GetVersion");
static_assert(sizeof(BPGGameInstance_GetVersion) == 0x000010, "Wrong size on BPGGameInstance_GetVersion");
static_assert(offsetof(BPGGameInstance_GetVersion, ReturnValue) == 0x000000, "Member 'BPGGameInstance_GetVersion::ReturnValue' has a wrong offset!");

// Function BPGLib.GamepadInputReceiver.OnGamepadInput
// 0x0048 (0x0048 - 0x0000)
struct GamepadInputReceiver_OnGamepadInput final
{
public:
	struct FKeyEvent                              _in_key_event;                                     // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B75[0x7];                                     // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(GamepadInputReceiver_OnGamepadInput) == 0x000008, "Wrong alignment on GamepadInputReceiver_OnGamepadInput");
static_assert(sizeof(GamepadInputReceiver_OnGamepadInput) == 0x000048, "Wrong size on GamepadInputReceiver_OnGamepadInput");
static_assert(offsetof(GamepadInputReceiver_OnGamepadInput, _in_key_event) == 0x000000, "Member 'GamepadInputReceiver_OnGamepadInput::_in_key_event' has a wrong offset!");
static_assert(offsetof(GamepadInputReceiver_OnGamepadInput, ReturnValue) == 0x000040, "Member 'GamepadInputReceiver_OnGamepadInput::ReturnValue' has a wrong offset!");

// Function BPGLib.GamepadInputReceiver.IsReadyGamepadFocus
// 0x0001 (0x0001 - 0x0000)
struct GamepadInputReceiver_IsReadyGamepadFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GamepadInputReceiver_IsReadyGamepadFocus) == 0x000001, "Wrong alignment on GamepadInputReceiver_IsReadyGamepadFocus");
static_assert(sizeof(GamepadInputReceiver_IsReadyGamepadFocus) == 0x000001, "Wrong size on GamepadInputReceiver_IsReadyGamepadFocus");
static_assert(offsetof(GamepadInputReceiver_IsReadyGamepadFocus, ReturnValue) == 0x000000, "Member 'GamepadInputReceiver_IsReadyGamepadFocus::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGInputSubsystem.SetCurrentInputType
// 0x0001 (0x0001 - 0x0000)
struct BPGInputSubsystem_SetCurrentInputType final
{
public:
	EInputMethodType                              _new_input_type;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGInputSubsystem_SetCurrentInputType) == 0x000001, "Wrong alignment on BPGInputSubsystem_SetCurrentInputType");
static_assert(sizeof(BPGInputSubsystem_SetCurrentInputType) == 0x000001, "Wrong size on BPGInputSubsystem_SetCurrentInputType");
static_assert(offsetof(BPGInputSubsystem_SetCurrentInputType, _new_input_type) == 0x000000, "Member 'BPGInputSubsystem_SetCurrentInputType::_new_input_type' has a wrong offset!");

// Function BPGLib.BPGInputSubsystem.GetCurrentInputType
// 0x0001 (0x0001 - 0x0000)
struct BPGInputSubsystem_GetCurrentInputType final
{
public:
	EInputMethodType                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGInputSubsystem_GetCurrentInputType) == 0x000001, "Wrong alignment on BPGInputSubsystem_GetCurrentInputType");
static_assert(sizeof(BPGInputSubsystem_GetCurrentInputType) == 0x000001, "Wrong size on BPGInputSubsystem_GetCurrentInputType");
static_assert(offsetof(BPGInputSubsystem_GetCurrentInputType, ReturnValue) == 0x000000, "Member 'BPGInputSubsystem_GetCurrentInputType::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.GetShowSyncError
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_GetShowSyncError final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_GetShowSyncError) == 0x000001, "Wrong alignment on BPGMovementComponent_GetShowSyncError");
static_assert(sizeof(BPGMovementComponent_GetShowSyncError) == 0x000001, "Wrong size on BPGMovementComponent_GetShowSyncError");
static_assert(offsetof(BPGMovementComponent_GetShowSyncError, ReturnValue) == 0x000000, "Member 'BPGMovementComponent_GetShowSyncError::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.SetShowSyncError
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_SetShowSyncError final
{
public:
	bool                                          _show;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_SetShowSyncError) == 0x000001, "Wrong alignment on BPGMovementComponent_SetShowSyncError");
static_assert(sizeof(BPGMovementComponent_SetShowSyncError) == 0x000001, "Wrong size on BPGMovementComponent_SetShowSyncError");
static_assert(offsetof(BPGMovementComponent_SetShowSyncError, _show) == 0x000000, "Member 'BPGMovementComponent_SetShowSyncError::_show' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.GetDebugInfoString
// 0x0010 (0x0010 - 0x0000)
struct BPGMovementComponent_GetDebugInfoString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_GetDebugInfoString) == 0x000008, "Wrong alignment on BPGMovementComponent_GetDebugInfoString");
static_assert(sizeof(BPGMovementComponent_GetDebugInfoString) == 0x000010, "Wrong size on BPGMovementComponent_GetDebugInfoString");
static_assert(offsetof(BPGMovementComponent_GetDebugInfoString, ReturnValue) == 0x000000, "Member 'BPGMovementComponent_GetDebugInfoString::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BPGMovementComponent_OnMontageEnded final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _interrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B7B[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BPGMovementComponent_OnMontageEnded) == 0x000008, "Wrong alignment on BPGMovementComponent_OnMontageEnded");
static_assert(sizeof(BPGMovementComponent_OnMontageEnded) == 0x000010, "Wrong size on BPGMovementComponent_OnMontageEnded");
static_assert(offsetof(BPGMovementComponent_OnMontageEnded, _montage) == 0x000000, "Member 'BPGMovementComponent_OnMontageEnded::_montage' has a wrong offset!");
static_assert(offsetof(BPGMovementComponent_OnMontageEnded, _interrupted) == 0x000008, "Member 'BPGMovementComponent_OnMontageEnded::_interrupted' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.OnMontageStarted
// 0x0008 (0x0008 - 0x0000)
struct BPGMovementComponent_OnMontageStarted final
{
public:
	class UAnimMontage*                           _montage;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_OnMontageStarted) == 0x000008, "Wrong alignment on BPGMovementComponent_OnMontageStarted");
static_assert(sizeof(BPGMovementComponent_OnMontageStarted) == 0x000008, "Wrong size on BPGMovementComponent_OnMontageStarted");
static_assert(offsetof(BPGMovementComponent_OnMontageStarted, _montage) == 0x000000, "Member 'BPGMovementComponent_OnMontageStarted::_montage' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.SetInitialMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_SetInitialMoveMode final
{
public:
	EMoveMode                                     _mode;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_SetInitialMoveMode) == 0x000001, "Wrong alignment on BPGMovementComponent_SetInitialMoveMode");
static_assert(sizeof(BPGMovementComponent_SetInitialMoveMode) == 0x000001, "Wrong size on BPGMovementComponent_SetInitialMoveMode");
static_assert(offsetof(BPGMovementComponent_SetInitialMoveMode, _mode) == 0x000000, "Member 'BPGMovementComponent_SetInitialMoveMode::_mode' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.SetMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_SetMoveMode final
{
public:
	EMoveMode                                     _mode;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_SetMoveMode) == 0x000001, "Wrong alignment on BPGMovementComponent_SetMoveMode");
static_assert(sizeof(BPGMovementComponent_SetMoveMode) == 0x000001, "Wrong size on BPGMovementComponent_SetMoveMode");
static_assert(offsetof(BPGMovementComponent_SetMoveMode, _mode) == 0x000000, "Member 'BPGMovementComponent_SetMoveMode::_mode' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.GetInitialMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_GetInitialMoveMode final
{
public:
	EMoveMode                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_GetInitialMoveMode) == 0x000001, "Wrong alignment on BPGMovementComponent_GetInitialMoveMode");
static_assert(sizeof(BPGMovementComponent_GetInitialMoveMode) == 0x000001, "Wrong size on BPGMovementComponent_GetInitialMoveMode");
static_assert(offsetof(BPGMovementComponent_GetInitialMoveMode, ReturnValue) == 0x000000, "Member 'BPGMovementComponent_GetInitialMoveMode::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGMovementComponent.GetMoveMode
// 0x0001 (0x0001 - 0x0000)
struct BPGMovementComponent_GetMoveMode final
{
public:
	EMoveMode                                     ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGMovementComponent_GetMoveMode) == 0x000001, "Wrong alignment on BPGMovementComponent_GetMoveMode");
static_assert(sizeof(BPGMovementComponent_GetMoveMode) == 0x000001, "Wrong size on BPGMovementComponent_GetMoveMode");
static_assert(offsetof(BPGMovementComponent_GetMoveMode, ReturnValue) == 0x000000, "Member 'BPGMovementComponent_GetMoveMode::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGPlayerController.ActivateCameraByTag
// 0x0018 (0x0018 - 0x0000)
struct BPGPlayerController_ActivateCameraByTag final
{
public:
	class FName                                   _Name;                                             // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _blending;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      _blend_func;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B7F[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	class AActor*                                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGPlayerController_ActivateCameraByTag) == 0x000008, "Wrong alignment on BPGPlayerController_ActivateCameraByTag");
static_assert(sizeof(BPGPlayerController_ActivateCameraByTag) == 0x000018, "Wrong size on BPGPlayerController_ActivateCameraByTag");
static_assert(offsetof(BPGPlayerController_ActivateCameraByTag, _Name) == 0x000000, "Member 'BPGPlayerController_ActivateCameraByTag::_Name' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_ActivateCameraByTag, _blending) == 0x000008, "Member 'BPGPlayerController_ActivateCameraByTag::_blending' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_ActivateCameraByTag, _blend_func) == 0x00000C, "Member 'BPGPlayerController_ActivateCameraByTag::_blend_func' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_ActivateCameraByTag, ReturnValue) == 0x000010, "Member 'BPGPlayerController_ActivateCameraByTag::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGPlayerController.CloseModalWithType
// 0x0008 (0x0008 - 0x0000)
struct BPGPlayerController_CloseModalWithType final
{
public:
	TSubclassOf<class UPopupBase>                 _class_type;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGPlayerController_CloseModalWithType) == 0x000008, "Wrong alignment on BPGPlayerController_CloseModalWithType");
static_assert(sizeof(BPGPlayerController_CloseModalWithType) == 0x000008, "Wrong size on BPGPlayerController_CloseModalWithType");
static_assert(offsetof(BPGPlayerController_CloseModalWithType, _class_type) == 0x000000, "Member 'BPGPlayerController_CloseModalWithType::_class_type' has a wrong offset!");

// Function BPGLib.BPGPlayerController.DoModal
// 0x0020 (0x0020 - 0x0000)
struct BPGPlayerController_DoModal final
{
public:
	class UPopupBase*                             _dlg;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPopupBase>                 _dlg_type;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _open_even_if_same_class;                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _hide_registered_background_widgets;               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B80[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class UPopupBase*                             ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BPGPlayerController_DoModal) == 0x000008, "Wrong alignment on BPGPlayerController_DoModal");
static_assert(sizeof(BPGPlayerController_DoModal) == 0x000020, "Wrong size on BPGPlayerController_DoModal");
static_assert(offsetof(BPGPlayerController_DoModal, _dlg) == 0x000000, "Member 'BPGPlayerController_DoModal::_dlg' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_DoModal, _dlg_type) == 0x000008, "Member 'BPGPlayerController_DoModal::_dlg_type' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_DoModal, _open_even_if_same_class) == 0x000010, "Member 'BPGPlayerController_DoModal::_open_even_if_same_class' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_DoModal, _hide_registered_background_widgets) == 0x000011, "Member 'BPGPlayerController_DoModal::_hide_registered_background_widgets' has a wrong offset!");
static_assert(offsetof(BPGPlayerController_DoModal, ReturnValue) == 0x000018, "Member 'BPGPlayerController_DoModal::ReturnValue' has a wrong offset!");

// Function BPGLib.BPGPlayerController.DoModalEx
// 0x0030 (0x0030 - 0x0000)
struct BPGPlayerController_DoModalEx final
{
public:
	class UPopupBase*                             _dlg;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UPopupBase>                 _dlg_type;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _open_even_if_same_class;                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _hide_registered_background_widgets;               // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B81[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	TDelegate<void(class UPopupBase* _popup, class FName _ctrl_id)> _proc;                                             // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B82[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class UPopupBase*                             ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
