#pragma once

/*
* SDK generated by Dumper-69
*
* https://github.com/Encryqed/Dumper-69
*/

// Package: Panel_CharacterPick

#include "Basic.hpp"

#include "Stigma_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "BPGLib_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Panel_CharacterPick.Panel_CharacterPick_C.AddDuplicatedCharacterWarning
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_AddDuplicatedCharacterWarning final
{
public:
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_AddDuplicatedCharacterWarning) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_AddDuplicatedCharacterWarning");
static_assert(sizeof(Panel_CharacterPick_C_AddDuplicatedCharacterWarning) == 0x000001, "Wrong size on Panel_CharacterPick_C_AddDuplicatedCharacterWarning");
static_assert(offsetof(Panel_CharacterPick_C_AddDuplicatedCharacterWarning, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_AddDuplicatedCharacterWarning::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.AddMessage
// 0x0048 (0x0048 - 0x0000)
struct Panel_CharacterPick_C_AddMessage final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          _force;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAE[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class FText                                   Txt;                                               // 0x0020(0x0018)(Edit, BlueprintVisible)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_AddMessage) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_AddMessage");
static_assert(sizeof(Panel_CharacterPick_C_AddMessage) == 0x000048, "Wrong size on Panel_CharacterPick_C_AddMessage");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, Text) == 0x000000, "Member 'Panel_CharacterPick_C_AddMessage::Text' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, _force) == 0x000018, "Member 'Panel_CharacterPick_C_AddMessage::_force' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, Txt) == 0x000020, "Member 'Panel_CharacterPick_C_AddMessage::Txt' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'Panel_CharacterPick_C_AddMessage::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000040, "Member 'Panel_CharacterPick_C_AddMessage::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'Panel_CharacterPick_C_AddMessage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_AddMessage, CallFunc_BooleanOR_ReturnValue) == 0x000042, "Member 'Panel_CharacterPick_C_AddMessage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Get_MasterSelect_Visibility
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility) == 0x000001, "Wrong size on Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Get_MasterSelect_Visibility::ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_ActiveSkills
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_ActiveSkills final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_ActiveSkills) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_ActiveSkills");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_ActiveSkills) == 0x000001, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_ActiveSkills");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_ActiveSkills, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_ActiveSkills::ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_BTN_ActiveSkills
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills) == 0x000001, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_BTN_ActiveSkills::ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_CharaPalette
// 0x0003 (0x0003 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_CharaPalette final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAPlayer_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_CharaPalette) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_CharaPalette");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_CharaPalette) == 0x000003, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_CharaPalette");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_CharaPalette, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_CharaPalette::ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_CharaPalette, CallFunc_IsAPlayer_ReturnValue) == 0x000001, "Member 'Panel_CharacterPick_C_BIND_Visibility_CharaPalette::CallFunc_IsAPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_CharaPalette, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'Panel_CharacterPick_C_BIND_Visibility_CharaPalette::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_ReadyButton
// 0x0003 (0x0003 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_ReadyButton final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAPlayer_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_ReadyButton) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_ReadyButton");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_ReadyButton) == 0x000003, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_ReadyButton");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_ReadyButton, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_ReadyButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_ReadyButton, CallFunc_IsAPlayer_ReturnValue) == 0x000001, "Member 'Panel_CharacterPick_C_BIND_Visibility_ReadyButton::CallFunc_IsAPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_ReadyButton, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'Panel_CharacterPick_C_BIND_Visibility_ReadyButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_Teams
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_Teams final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_Teams) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_Teams");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_Teams) == 0x000001, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_Teams");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_Teams, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_Teams::ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BIND_Visibility_TopCharaName
// 0x0005 (0x0005 - 0x0000)
struct Panel_CharacterPick_C_BIND_Visibility_TopCharaName final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAPlayer_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BIND_Visibility_TopCharaName");
static_assert(sizeof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName) == 0x000005, "Wrong size on Panel_CharacterPick_C_BIND_Visibility_TopCharaName");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName, ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_BIND_Visibility_TopCharaName::ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Panel_CharacterPick_C_BIND_Visibility_TopCharaName::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName, CallFunc_IsAPlayer_ReturnValue) == 0x000002, "Member 'Panel_CharacterPick_C_BIND_Visibility_TopCharaName::CallFunc_IsAPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'Panel_CharacterPick_C_BIND_Visibility_TopCharaName::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BIND_Visibility_TopCharaName, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'Panel_CharacterPick_C_BIND_Visibility_TopCharaName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BindConfirmEvent
// 0x0028 (0x0028 - 0x0000)
struct Panel_CharacterPick_C_BindConfirmEvent final
{
public:
	TDelegate<void(EConfirmResponse Response)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AMatchServicedPlayerController*         K2Node_DynamicCast_AsMatch_Serviced_Player_Controller; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BindConfirmEvent) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_BindConfirmEvent");
static_assert(sizeof(Panel_CharacterPick_C_BindConfirmEvent) == 0x000028, "Wrong size on Panel_CharacterPick_C_BindConfirmEvent");
static_assert(offsetof(Panel_CharacterPick_C_BindConfirmEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Panel_CharacterPick_C_BindConfirmEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BindConfirmEvent, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'Panel_CharacterPick_C_BindConfirmEvent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BindConfirmEvent, K2Node_DynamicCast_AsMatch_Serviced_Player_Controller) == 0x000018, "Member 'Panel_CharacterPick_C_BindConfirmEvent::K2Node_DynamicCast_AsMatch_Serviced_Player_Controller' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BindConfirmEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Panel_CharacterPick_C_BindConfirmEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Map_K2Node_ComponentBoundEvent_6_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_CB_Mode_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature final
{
public:
	ECharaType                                    _chara_type;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature");
static_assert(sizeof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature) == 0x000001, "Wrong size on Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature");
static_assert(offsetof(Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature, _chara_type) == 0x000000, "Member 'Panel_CharacterPick_C_BndEvt__UI_WaitingRoom_Panel_Characters_K2Node_ComponentBoundEvent_0_OnCharacterSelected__DelegateSignature::_chara_type' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.CheckAndUpdateMapAndMode
// 0x0068 (0x0068 - 0x0000)
struct Panel_CharacterPick_C_CheckAndUpdateMapAndMode final
{
public:
	class FString                                 Map_name;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EGameMode                                     Game_mode;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DAF[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class AMatchServicedGameState*                CallFunc_GameState__game_state;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB0[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-69 ])
	struct FGameSetting                           CallFunc_GetGameSetting_ReturnValue;               // 0x0028(0x0040)(ConstParm)
};
static_assert(alignof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_CheckAndUpdateMapAndMode");
static_assert(sizeof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode) == 0x000068, "Wrong size on Panel_CharacterPick_C_CheckAndUpdateMapAndMode");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, Map_name) == 0x000000, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::Map_name' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, Game_mode) == 0x000010, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::Game_mode' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_GameState__game_state) == 0x000018, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_GameState__game_state' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_NotEqual_StriStri_ReturnValue) == 0x000020, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_NotEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckAndUpdateMapAndMode, CallFunc_GetGameSetting_ReturnValue) == 0x000028, "Member 'Panel_CharacterPick_C_CheckAndUpdateMapAndMode::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.CheckMasterMissionBrief
// 0x0004 (0x0004 - 0x0000)
struct Panel_CharacterPick_C_CheckMasterMissionBrief final
{
public:
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMasterMission_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InitWidget_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_CheckMasterMissionBrief) == 0x000001, "Wrong alignment on Panel_CharacterPick_C_CheckMasterMissionBrief");
static_assert(sizeof(Panel_CharacterPick_C_CheckMasterMissionBrief) == 0x000004, "Wrong size on Panel_CharacterPick_C_CheckMasterMissionBrief");
static_assert(offsetof(Panel_CharacterPick_C_CheckMasterMissionBrief, CallFunc_IsStandalone_ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_CheckMasterMissionBrief::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckMasterMissionBrief, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'Panel_CharacterPick_C_CheckMasterMissionBrief::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckMasterMissionBrief, CallFunc_HasMasterMission_ReturnValue) == 0x000002, "Member 'Panel_CharacterPick_C_CheckMasterMissionBrief::CallFunc_HasMasterMission_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CheckMasterMissionBrief, CallFunc_InitWidget_ReturnValue) == 0x000003, "Member 'Panel_CharacterPick_C_CheckMasterMissionBrief::CallFunc_InitWidget_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.ClearMessage
// 0x0018 (0x0018 - 0x0000)
struct Panel_CharacterPick_C_ClearMessage final
{
public:
	class FText                                   Txt;                                               // 0x0000(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(Panel_CharacterPick_C_ClearMessage) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_ClearMessage");
static_assert(sizeof(Panel_CharacterPick_C_ClearMessage) == 0x000018, "Wrong size on Panel_CharacterPick_C_ClearMessage");
static_assert(offsetof(Panel_CharacterPick_C_ClearMessage, Txt) == 0x000000, "Member 'Panel_CharacterPick_C_ClearMessage::Txt' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.CreatePlayerWidget
// 0x00B0 (0x00B0 - 0x0000)
struct Panel_CharacterPick_C_CreatePlayerWidget final
{
public:
	class AMatchServicedPlayerState*              _ps;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UCtrl_Player_C*>                 Ally;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UVerticalBoxSlot*                       Vslot;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCtrl_EnemyPlayer_C*                    Enemy_ctrl;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Ctrl;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCtrl_Player_C*                         Ally_ctrl;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AMatchServicedPlayerState*              Ps;                                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB1[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class UCtrl_Player_C*                         CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AStigmaPlayerController*                CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB2[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<class UUserWidget*>                    CallFunc_Map_Values_Values;                        // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB3[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class UCtrl_Player_C*                         K2Node_DynamicCast_AsCtrl_Player;                  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EJoinType                                     CallFunc_GetJoinType_ReturnValue;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerSide                                   CallFunc_GetPlayerSideAgainstLocalPlayer_ReturnValue; // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB4[0x2];                                     // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB5[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_CreatePlayerWidget) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_CreatePlayerWidget");
static_assert(sizeof(Panel_CharacterPick_C_CreatePlayerWidget) == 0x0000B0, "Wrong size on Panel_CharacterPick_C_CreatePlayerWidget");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, _ps) == 0x000000, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::_ps' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Ally) == 0x000008, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Ally' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Vslot) == 0x000018, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Vslot' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Enemy_ctrl) == 0x000020, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Enemy_ctrl' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Ctrl) == 0x000028, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Ctrl' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Ally_ctrl) == 0x000030, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Ally_ctrl' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Ps) == 0x000038, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Ps' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Temp_int_Array_Index_Variable) == 0x000040, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Create_ReturnValue) == 0x000048, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000050, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000058, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Map_Values_Values) == 0x000060, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Array_Get_Item) == 0x000070, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, K2Node_DynamicCast_AsCtrl_Player) == 0x000080, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::K2Node_DynamicCast_AsCtrl_Player' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_IsValid_ReturnValue) == 0x000089, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_GetJoinType_ReturnValue) == 0x00008A, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_GetJoinType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008B, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_GetPlayerSideAgainstLocalPlayer_ReturnValue) == 0x00008C, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_GetPlayerSideAgainstLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00008D, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_AddChildToVerticalBox_ReturnValue_1) == 0x000098, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_AddChildToVerticalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, Temp_int_Loop_Counter_Variable) == 0x0000A0, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_CreatePlayerWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'Panel_CharacterPick_C_CreatePlayerWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.DEV_BuildModeAndMapCombo
// 0x0590 (0x0590 - 0x0000)
struct Panel_CharacterPick_C_DEV_BuildModeAndMapCombo final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMapEntry>                      CallFunc_GetAllMaps_ReturnValue;                   // 0x0018(0x0010)(ReferenceParm)
	class AMatchServicedGameState*                CallFunc_GameState__game_state;                    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMapEntry                              CallFunc_Array_Get_Item;                           // 0x0030(0x0158)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB6[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 CallFunc_GetMapName_ReturnValue;                   // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameSetting                           CallFunc_GetGameSetting_ReturnValue;               // 0x01A0(0x0040)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB7[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x01E8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB8[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FMode                                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0208(0x0370)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DB9[0x6];                                     // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_DEV_BuildModeAndMapCombo");
static_assert(sizeof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo) == 0x000590, "Wrong size on Panel_CharacterPick_C_DEV_BuildModeAndMapCombo");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetAllMaps_ReturnValue) == 0x000018, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetAllMaps_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GameState__game_state) == 0x000028, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GameState__game_state' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Array_Get_Item) == 0x000030, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_IsValid_ReturnValue) == 0x000188, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetMapName_ReturnValue) == 0x000190, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetMapName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetGameSetting_ReturnValue) == 0x0001A0, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Array_Length_ReturnValue) == 0x0001E0, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Less_IntInt_ReturnValue) == 0x0001E4, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetDataTableRowNames_OutRowNames) == 0x0001E8, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Array_Get_Item_1) == 0x0001F8, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Array_Length_ReturnValue_1) == 0x000200, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000208, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000578, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_Less_IntInt_ReturnValue_1) == 0x000579, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_BuildModeAndMapCombo, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000580, "Member 'Panel_CharacterPick_C_DEV_BuildModeAndMapCombo::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.DEV_SelectMode
// 0x0048 (0x0048 - 0x0000)
struct Panel_CharacterPick_C_DEV_SelectMode final
{
public:
	EGameMode                                     _mode;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _notify;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Notify;                                            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameMode                                     Mode;                                              // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 CallFunc_DEV_GetSelectedMap__map;                  // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBB[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AWaitingRoomPlayerController*           K2Node_DynamicCast_AsWaiting_Room_Player_Controller; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBC[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_DEV_SelectMode) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_DEV_SelectMode");
static_assert(sizeof(Panel_CharacterPick_C_DEV_SelectMode) == 0x000048, "Wrong size on Panel_CharacterPick_C_DEV_SelectMode");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, _mode) == 0x000000, "Member 'Panel_CharacterPick_C_DEV_SelectMode::_mode' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, _notify) == 0x000001, "Member 'Panel_CharacterPick_C_DEV_SelectMode::_notify' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, Notify) == 0x000002, "Member 'Panel_CharacterPick_C_DEV_SelectMode::Notify' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, Mode) == 0x000003, "Member 'Panel_CharacterPick_C_DEV_SelectMode::Mode' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, CallFunc_DEV_GetSelectedMap__map) == 0x000008, "Member 'Panel_CharacterPick_C_DEV_SelectMode::CallFunc_DEV_GetSelectedMap__map' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, CallFunc_IsEmpty_ReturnValue) == 0x000018, "Member 'Panel_CharacterPick_C_DEV_SelectMode::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'Panel_CharacterPick_C_DEV_SelectMode::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, K2Node_DynamicCast_AsWaiting_Room_Player_Controller) == 0x000028, "Member 'Panel_CharacterPick_C_DEV_SelectMode::K2Node_DynamicCast_AsWaiting_Room_Player_Controller' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Panel_CharacterPick_C_DEV_SelectMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DEV_SelectMode, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'Panel_CharacterPick_C_DEV_SelectMode::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function Panel_CharacterPick.Panel_CharacterPick_C.DriveDuplicatedCharaText
// 0x0068 (0x0068 - 0x0000)
struct Panel_CharacterPick_C_DriveDuplicatedCharaText final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABattleGameStateBase*                   K2Node_DynamicCast_AsBattle_Game_State_Base;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBD[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class AWaitingRoomGameState*                  K2Node_DynamicCast_AsWaiting_Room_Game_State;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBE[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLeftSeconds_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DBF[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	class AMatchServicedGameState*                K2Node_DynamicCast_AsMatch_Serviced_Game_State;    // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC0[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class AMatchServicedPlayerState*              CallFunc_GetPlayerState__player_state;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC1[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	struct FUserID                                CallFunc_GetUserID_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPickedCharaInTeam_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyToFight_ReturnValue;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Panel_CharacterPick_C_DriveDuplicatedCharaText) == 0x000008, "Wrong alignment on Panel_CharacterPick_C_DriveDuplicatedCharaText");
static_assert(sizeof(Panel_CharacterPick_C_DriveDuplicatedCharaText) == 0x000068, "Wrong size on Panel_CharacterPick_C_DriveDuplicatedCharaText");
static_assert(offsetof(Panel_CharacterPick_C_DriveDuplicatedCharaText, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'Panel_CharacterPick_C_DriveDuplicatedCharaText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Panel_CharacterPick_C_DriveDuplicatedCharaText, K2Node_DynamicCast_AsBattle_Game_State_Base) == 0x000008, "Member 'Panel_CharacterPick_C_DriveDuplicatedCharaText::K2Node_DynamicCast_AsBattle_Game_State_Base' has a wrong offset!");
