#pragma once

/*
* SDK generated by Dumper-69
*
* https://github.com/Encryqed/Dumper-69
*/

// Package: Stigma

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Stigma_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ActionGraph_structs.hpp"
#include "BPGLib_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function Stigma.StigmaPlayerController.AddChara2DVoice
// 0x0020 (0x0020 - 0x0000)
struct StigmaPlayerController_AddChara2DVoice final
{
public:
	class FString                                 _voice_id;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                           _player_state;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharaType                                    _speak_chara_type;                                 // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _is_radio;                                         // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F25[0x6];                                     // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(StigmaPlayerController_AddChara2DVoice) == 0x000008, "Wrong alignment on StigmaPlayerController_AddChara2DVoice");
static_assert(sizeof(StigmaPlayerController_AddChara2DVoice) == 0x000020, "Wrong size on StigmaPlayerController_AddChara2DVoice");
static_assert(offsetof(StigmaPlayerController_AddChara2DVoice, _voice_id) == 0x000000, "Member 'StigmaPlayerController_AddChara2DVoice::_voice_id' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddChara2DVoice, _player_state) == 0x000010, "Member 'StigmaPlayerController_AddChara2DVoice::_player_state' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddChara2DVoice, _speak_chara_type) == 0x000018, "Member 'StigmaPlayerController_AddChara2DVoice::_speak_chara_type' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddChara2DVoice, _is_radio) == 0x000019, "Member 'StigmaPlayerController_AddChara2DVoice::_is_radio' has a wrong offset!");

// Function Stigma.StigmaPlayerController.AddGameNotify
// 0x0028 (0x0028 - 0x0000)
struct StigmaPlayerController_AddGameNotify final
{
public:
	class FName                                   _notify_name;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   _text;                                             // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         _time;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F26[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(StigmaPlayerController_AddGameNotify) == 0x000008, "Wrong alignment on StigmaPlayerController_AddGameNotify");
static_assert(sizeof(StigmaPlayerController_AddGameNotify) == 0x000028, "Wrong size on StigmaPlayerController_AddGameNotify");
static_assert(offsetof(StigmaPlayerController_AddGameNotify, _notify_name) == 0x000000, "Member 'StigmaPlayerController_AddGameNotify::_notify_name' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddGameNotify, _text) == 0x000008, "Member 'StigmaPlayerController_AddGameNotify::_text' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddGameNotify, _time) == 0x000020, "Member 'StigmaPlayerController_AddGameNotify::_time' has a wrong offset!");

// Function Stigma.StigmaPlayerController.AddTickTask
// 0x0014 (0x0014 - 0x0000)
struct StigmaPlayerController_AddTickTask final
{
public:
	float                                         _duration;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float _delta, float _elaped, ETickTaskState _state)> _task;                                             // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StigmaPlayerController_AddTickTask) == 0x000004, "Wrong alignment on StigmaPlayerController_AddTickTask");
static_assert(sizeof(StigmaPlayerController_AddTickTask) == 0x000014, "Wrong size on StigmaPlayerController_AddTickTask");
static_assert(offsetof(StigmaPlayerController_AddTickTask, _duration) == 0x000000, "Member 'StigmaPlayerController_AddTickTask::_duration' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddTickTask, _task) == 0x000004, "Member 'StigmaPlayerController_AddTickTask::_task' has a wrong offset!");

// Function Stigma.StigmaPlayerController.AddVoice
// 0x0020 (0x0020 - 0x0000)
struct StigmaPlayerController_AddVoice final
{
public:
	class FString                                 _voice_id;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharaBase*                             _speak_chara;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _is_3d_voice;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F27[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(StigmaPlayerController_AddVoice) == 0x000008, "Wrong alignment on StigmaPlayerController_AddVoice");
static_assert(sizeof(StigmaPlayerController_AddVoice) == 0x000020, "Wrong size on StigmaPlayerController_AddVoice");
static_assert(offsetof(StigmaPlayerController_AddVoice, _voice_id) == 0x000000, "Member 'StigmaPlayerController_AddVoice::_voice_id' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddVoice, _speak_chara) == 0x000010, "Member 'StigmaPlayerController_AddVoice::_speak_chara' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_AddVoice, _is_3d_voice) == 0x000018, "Member 'StigmaPlayerController_AddVoice::_is_3d_voice' has a wrong offset!");

// Function Stigma.StigmaPlayerController.HideAllGameNotifies
// 0x0001 (0x0001 - 0x0000)
struct StigmaPlayerController_HideAllGameNotifies final
{
public:
	bool                                          _hide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StigmaPlayerController_HideAllGameNotifies) == 0x000001, "Wrong alignment on StigmaPlayerController_HideAllGameNotifies");
static_assert(sizeof(StigmaPlayerController_HideAllGameNotifies) == 0x000001, "Wrong size on StigmaPlayerController_HideAllGameNotifies");
static_assert(offsetof(StigmaPlayerController_HideAllGameNotifies, _hide) == 0x000000, "Member 'StigmaPlayerController_HideAllGameNotifies::_hide' has a wrong offset!");

// Function Stigma.StigmaPlayerController.MapJump
// 0x000C (0x000C - 0x0000)
struct StigmaPlayerController_MapJump final
{
public:
	class FName                                   _level_name;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         _fadeout_time;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StigmaPlayerController_MapJump) == 0x000004, "Wrong alignment on StigmaPlayerController_MapJump");
static_assert(sizeof(StigmaPlayerController_MapJump) == 0x00000C, "Wrong size on StigmaPlayerController_MapJump");
static_assert(offsetof(StigmaPlayerController_MapJump, _level_name) == 0x000000, "Member 'StigmaPlayerController_MapJump::_level_name' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_MapJump, _fadeout_time) == 0x000008, "Member 'StigmaPlayerController_MapJump::_fadeout_time' has a wrong offset!");

// Function Stigma.StigmaPlayerController.RemoveGameNotify
// 0x000C (0x000C - 0x0000)
struct StigmaPlayerController_RemoveGameNotify final
{
public:
	class FName                                   _notify_name;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _force_remove;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F28[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(StigmaPlayerController_RemoveGameNotify) == 0x000004, "Wrong alignment on StigmaPlayerController_RemoveGameNotify");
static_assert(sizeof(StigmaPlayerController_RemoveGameNotify) == 0x00000C, "Wrong size on StigmaPlayerController_RemoveGameNotify");
static_assert(offsetof(StigmaPlayerController_RemoveGameNotify, _notify_name) == 0x000000, "Member 'StigmaPlayerController_RemoveGameNotify::_notify_name' has a wrong offset!");
static_assert(offsetof(StigmaPlayerController_RemoveGameNotify, _force_remove) == 0x000008, "Member 'StigmaPlayerController_RemoveGameNotify::_force_remove' has a wrong offset!");

// Function Stigma.StigmaPlayerController.ShowQuickPurchaseCurrencyPopup
// 0x0010 (0x0010 - 0x0000)
struct StigmaPlayerController_ShowQuickPurchaseCurrencyPopup final
{
public:
	struct FItemID_Currency                       _currency_id;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StigmaPlayerController_ShowQuickPurchaseCurrencyPopup) == 0x000008, "Wrong alignment on StigmaPlayerController_ShowQuickPurchaseCurrencyPopup");
static_assert(sizeof(StigmaPlayerController_ShowQuickPurchaseCurrencyPopup) == 0x000010, "Wrong size on StigmaPlayerController_ShowQuickPurchaseCurrencyPopup");
static_assert(offsetof(StigmaPlayerController_ShowQuickPurchaseCurrencyPopup, _currency_id) == 0x000000, "Member 'StigmaPlayerController_ShowQuickPurchaseCurrencyPopup::_currency_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.OnChangeServerState
// 0x0002 (0x0002 - 0x0000)
struct MatchServicedPlayerController_OnChangeServerState final
{
public:
	EServerStatus                                 _server_state;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_OnChangeServerState) == 0x000001, "Wrong alignment on MatchServicedPlayerController_OnChangeServerState");
static_assert(sizeof(MatchServicedPlayerController_OnChangeServerState) == 0x000002, "Wrong size on MatchServicedPlayerController_OnChangeServerState");
static_assert(offsetof(MatchServicedPlayerController_OnChangeServerState, _server_state) == 0x000000, "Member 'MatchServicedPlayerController_OnChangeServerState::_server_state' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_OnChangeServerState, ReturnValue) == 0x000001, "Member 'MatchServicedPlayerController_OnChangeServerState::ReturnValue' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.OnClient_UpdateSharedPlayerState
// 0x0008 (0x0008 - 0x0000)
struct MatchServicedPlayerController_OnClient_UpdateSharedPlayerState final
{
public:
	class AMatchServicedPlayerState*              _player_state;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_OnClient_UpdateSharedPlayerState) == 0x000008, "Wrong alignment on MatchServicedPlayerController_OnClient_UpdateSharedPlayerState");
static_assert(sizeof(MatchServicedPlayerController_OnClient_UpdateSharedPlayerState) == 0x000008, "Wrong size on MatchServicedPlayerController_OnClient_UpdateSharedPlayerState");
static_assert(offsetof(MatchServicedPlayerController_OnClient_UpdateSharedPlayerState, _player_state) == 0x000000, "Member 'MatchServicedPlayerController_OnClient_UpdateSharedPlayerState::_player_state' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.OnRep_NetID
// 0x0002 (0x0002 - 0x0000)
struct MatchServicedPlayerController_OnRep_NetID final
{
public:
	struct FNetID                                 _old_id;                                           // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_OnRep_NetID) == 0x000001, "Wrong alignment on MatchServicedPlayerController_OnRep_NetID");
static_assert(sizeof(MatchServicedPlayerController_OnRep_NetID) == 0x000002, "Wrong size on MatchServicedPlayerController_OnRep_NetID");
static_assert(offsetof(MatchServicedPlayerController_OnRep_NetID, _old_id) == 0x000000, "Member 'MatchServicedPlayerController_OnRep_NetID::_old_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_CLI_SendChat
// 0x0058 (0x0058 - 0x0000)
struct MatchServicedPlayerController_RPC_CLI_SendChat final
{
public:
	struct FChatMsg                               _msg;                                              // 0x0000(0x0058)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_CLI_SendChat) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_CLI_SendChat");
static_assert(sizeof(MatchServicedPlayerController_RPC_CLI_SendChat) == 0x000058, "Wrong size on MatchServicedPlayerController_RPC_CLI_SendChat");
static_assert(offsetof(MatchServicedPlayerController_RPC_CLI_SendChat, _msg) == 0x000000, "Member 'MatchServicedPlayerController_RPC_CLI_SendChat::_msg' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_CLIENT_TryReady_ACK
// 0x0001 (0x0001 - 0x0000)
struct MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK final
{
public:
	struct FConfirmResponse                       _response;                                         // 0x0000(0x0001)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK) == 0x000001, "Wrong alignment on MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK");
static_assert(sizeof(MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK) == 0x000001, "Wrong size on MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK");
static_assert(offsetof(MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK, _response) == 0x000000, "Member 'MatchServicedPlayerController_RPC_CLIENT_TryReady_ACK::_response' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_CLIENT_WarnChangingGun
// 0x0018 (0x0018 - 0x0000)
struct MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun final
{
public:
	ECharaType                                    _chara_type;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F2C[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	struct FGunPreset                             _gun_preset;                                       // 0x0008(0x0010)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun");
static_assert(sizeof(MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun) == 0x000018, "Wrong size on MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun");
static_assert(offsetof(MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun, _chara_type) == 0x000000, "Member 'MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun::_chara_type' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun, _gun_preset) == 0x000008, "Member 'MatchServicedPlayerController_RPC_CLIENT_WarnChangingGun::_gun_preset' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_SendChat
// 0x0058 (0x0058 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_SendChat final
{
public:
	struct FChatMsg                               _msg;                                              // 0x0000(0x0058)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_SendChat) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_SendChat");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_SendChat) == 0x000058, "Wrong size on MatchServicedPlayerController_RPC_SERVER_SendChat");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SendChat, _msg) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_SendChat::_msg' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_SetCharacterSetting
// 0x0020 (0x0020 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting final
{
public:
	int32                                         _zidx_chara;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F2D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FItemID                                _item_id;                                          // 0x0008(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         _slot_zidx;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F2E[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting) == 0x000020, "Wrong size on MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting, _zidx_chara) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting::_zidx_chara' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting, _item_id) == 0x000008, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting::_item_id' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting, _slot_zidx) == 0x000018, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCharacterSetting::_slot_zidx' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_SetCostume
// 0x0028 (0x0028 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_SetCostume final
{
public:
	TArray<struct FLocalCharacterSet>             _local_picked_charas;                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         _zidx_chara;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F2F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FItemID                                _item_id;                                          // 0x0018(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_SetCostume) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_SetCostume");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_SetCostume) == 0x000028, "Wrong size on MatchServicedPlayerController_RPC_SERVER_SetCostume");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCostume, _local_picked_charas) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCostume::_local_picked_charas' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCostume, _zidx_chara) == 0x000010, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCostume::_zidx_chara' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetCostume, _item_id) == 0x000018, "Member 'MatchServicedPlayerController_RPC_SERVER_SetCostume::_item_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_SetGunPreset
// 0x0028 (0x0028 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_SetGunPreset final
{
public:
	TArray<struct FLocalCharacterSet>             _local_picked_charas;                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         _zidx_chara;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F30[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FGunPreset                             _gun_preset;                                       // 0x0018(0x0010)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_SetGunPreset) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_SetGunPreset");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_SetGunPreset) == 0x000028, "Wrong size on MatchServicedPlayerController_RPC_SERVER_SetGunPreset");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetGunPreset, _local_picked_charas) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_SetGunPreset::_local_picked_charas' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetGunPreset, _zidx_chara) == 0x000010, "Member 'MatchServicedPlayerController_RPC_SERVER_SetGunPreset::_zidx_chara' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_SetGunPreset, _gun_preset) == 0x000018, "Member 'MatchServicedPlayerController_RPC_SERVER_SetGunPreset::_gun_preset' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_TryReady
// 0x0018 (0x0018 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_TryReady final
{
public:
	TArray<struct FLocalCharacterSet>             _local_picked_charas;                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          _i_am_ready;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          _forced;                                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F31[0x6];                                     // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_TryReady) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_TryReady");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_TryReady) == 0x000018, "Wrong size on MatchServicedPlayerController_RPC_SERVER_TryReady");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_TryReady, _local_picked_charas) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_TryReady::_local_picked_charas' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_TryReady, _i_am_ready) == 0x000010, "Member 'MatchServicedPlayerController_RPC_SERVER_TryReady::_i_am_ready' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_TryReady, _forced) == 0x000011, "Member 'MatchServicedPlayerController_RPC_SERVER_TryReady::_forced' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.RPC_SERVER_UpdateBooster
// 0x0018 (0x0018 - 0x0000)
struct MatchServicedPlayerController_RPC_SERVER_UpdateBooster final
{
public:
	int32                                         _slot_index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F32[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-69 ])
	struct FItemID                                _item_id;                                          // 0x0008(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_RPC_SERVER_UpdateBooster) == 0x000008, "Wrong alignment on MatchServicedPlayerController_RPC_SERVER_UpdateBooster");
static_assert(sizeof(MatchServicedPlayerController_RPC_SERVER_UpdateBooster) == 0x000018, "Wrong size on MatchServicedPlayerController_RPC_SERVER_UpdateBooster");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_UpdateBooster, _slot_index) == 0x000000, "Member 'MatchServicedPlayerController_RPC_SERVER_UpdateBooster::_slot_index' has a wrong offset!");
static_assert(offsetof(MatchServicedPlayerController_RPC_SERVER_UpdateBooster, _item_id) == 0x000008, "Member 'MatchServicedPlayerController_RPC_SERVER_UpdateBooster::_item_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.SERVER_SetNetID
// 0x0002 (0x0002 - 0x0000)
struct MatchServicedPlayerController_SERVER_SetNetID final
{
public:
	struct FNetID                                 _net_id;                                           // 0x0000(0x0002)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_SERVER_SetNetID) == 0x000001, "Wrong alignment on MatchServicedPlayerController_SERVER_SetNetID");
static_assert(sizeof(MatchServicedPlayerController_SERVER_SetNetID) == 0x000002, "Wrong size on MatchServicedPlayerController_SERVER_SetNetID");
static_assert(offsetof(MatchServicedPlayerController_SERVER_SetNetID, _net_id) == 0x000000, "Member 'MatchServicedPlayerController_SERVER_SetNetID::_net_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.Setter_NetID
// 0x0002 (0x0002 - 0x0000)
struct MatchServicedPlayerController_Setter_NetID final
{
public:
	struct FNetID                                 _new_id;                                           // 0x0000(0x0002)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_Setter_NetID) == 0x000001, "Wrong alignment on MatchServicedPlayerController_Setter_NetID");
static_assert(sizeof(MatchServicedPlayerController_Setter_NetID) == 0x000002, "Wrong size on MatchServicedPlayerController_Setter_NetID");
static_assert(offsetof(MatchServicedPlayerController_Setter_NetID, _new_id) == 0x000000, "Member 'MatchServicedPlayerController_Setter_NetID::_new_id' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.ShowRewardedPopup
// 0x0020 (0x0020 - 0x0000)
struct MatchServicedPlayerController_ShowRewardedPopup final
{
public:
	struct FRewardPlain                           _reward_plain;                                     // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_ShowRewardedPopup) == 0x000008, "Wrong alignment on MatchServicedPlayerController_ShowRewardedPopup");
static_assert(sizeof(MatchServicedPlayerController_ShowRewardedPopup) == 0x000020, "Wrong size on MatchServicedPlayerController_ShowRewardedPopup");
static_assert(offsetof(MatchServicedPlayerController_ShowRewardedPopup, _reward_plain) == 0x000000, "Member 'MatchServicedPlayerController_ShowRewardedPopup::_reward_plain' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.GetCurrentCharacterInfo
// 0x0058 (0x0058 - 0x0000)
struct MatchServicedPlayerController_GetCurrentCharacterInfo final
{
public:
	struct FCharacterInfo                         ReturnValue;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_GetCurrentCharacterInfo) == 0x000008, "Wrong alignment on MatchServicedPlayerController_GetCurrentCharacterInfo");
static_assert(sizeof(MatchServicedPlayerController_GetCurrentCharacterInfo) == 0x000058, "Wrong size on MatchServicedPlayerController_GetCurrentCharacterInfo");
static_assert(offsetof(MatchServicedPlayerController_GetCurrentCharacterInfo, ReturnValue) == 0x000000, "Member 'MatchServicedPlayerController_GetCurrentCharacterInfo::ReturnValue' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.GetNetID
// 0x0002 (0x0002 - 0x0000)
struct MatchServicedPlayerController_GetNetID final
{
public:
	struct FNetID                                 ReturnValue;                                       // 0x0000(0x0002)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_GetNetID) == 0x000001, "Wrong alignment on MatchServicedPlayerController_GetNetID");
static_assert(sizeof(MatchServicedPlayerController_GetNetID) == 0x000002, "Wrong size on MatchServicedPlayerController_GetNetID");
static_assert(offsetof(MatchServicedPlayerController_GetNetID, ReturnValue) == 0x000000, "Member 'MatchServicedPlayerController_GetNetID::ReturnValue' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.GetOwnCharacter
// 0x0008 (0x0008 - 0x0000)
struct MatchServicedPlayerController_GetOwnCharacter final
{
public:
	class ACharaBase*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_GetOwnCharacter) == 0x000008, "Wrong alignment on MatchServicedPlayerController_GetOwnCharacter");
static_assert(sizeof(MatchServicedPlayerController_GetOwnCharacter) == 0x000008, "Wrong size on MatchServicedPlayerController_GetOwnCharacter");
static_assert(offsetof(MatchServicedPlayerController_GetOwnCharacter, ReturnValue) == 0x000000, "Member 'MatchServicedPlayerController_GetOwnCharacter::ReturnValue' has a wrong offset!");

// Function Stigma.MatchServicedPlayerController.GetTeam
// 0x0001 (0x0001 - 0x0000)
struct MatchServicedPlayerController_GetTeam final
{
public:
	ETeams                                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MatchServicedPlayerController_GetTeam) == 0x000001, "Wrong alignment on MatchServicedPlayerController_GetTeam");
static_assert(sizeof(MatchServicedPlayerController_GetTeam) == 0x000001, "Wrong size on MatchServicedPlayerController_GetTeam");
static_assert(offsetof(MatchServicedPlayerController_GetTeam, ReturnValue) == 0x000000, "Member 'MatchServicedPlayerController_GetTeam::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.AddFullScreenWidget
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_AddFullScreenWidget final
{
public:
	class UWidget*                                _widget;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_AddFullScreenWidget) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_AddFullScreenWidget");
static_assert(sizeof(BattlePlayerControllerBase_AddFullScreenWidget) == 0x000008, "Wrong size on BattlePlayerControllerBase_AddFullScreenWidget");
static_assert(offsetof(BattlePlayerControllerBase_AddFullScreenWidget, _widget) == 0x000000, "Member 'BattlePlayerControllerBase_AddFullScreenWidget::_widget' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.AddToastIfLackControlPower
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_AddToastIfLackControlPower final
{
public:
	class AGunBase*                               _gun;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_AddToastIfLackControlPower) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_AddToastIfLackControlPower");
static_assert(sizeof(BattlePlayerControllerBase_AddToastIfLackControlPower) == 0x000008, "Wrong size on BattlePlayerControllerBase_AddToastIfLackControlPower");
static_assert(offsetof(BattlePlayerControllerBase_AddToastIfLackControlPower, _gun) == 0x000000, "Member 'BattlePlayerControllerBase_AddToastIfLackControlPower::_gun' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.DEBUG_CreateNewCharacter
// 0x0010 (0x0010 - 0x0000)
struct BattlePlayerControllerBase_DEBUG_CreateNewCharacter final
{
public:
	ECharaType                                    _type;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGunType                                      _gun_type;                                         // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3D[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	class ACharaBase*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_DEBUG_CreateNewCharacter) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_DEBUG_CreateNewCharacter");
static_assert(sizeof(BattlePlayerControllerBase_DEBUG_CreateNewCharacter) == 0x000010, "Wrong size on BattlePlayerControllerBase_DEBUG_CreateNewCharacter");
static_assert(offsetof(BattlePlayerControllerBase_DEBUG_CreateNewCharacter, _type) == 0x000000, "Member 'BattlePlayerControllerBase_DEBUG_CreateNewCharacter::_type' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_DEBUG_CreateNewCharacter, _gun_type) == 0x000001, "Member 'BattlePlayerControllerBase_DEBUG_CreateNewCharacter::_gun_type' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_DEBUG_CreateNewCharacter, ReturnValue) == 0x000008, "Member 'BattlePlayerControllerBase_DEBUG_CreateNewCharacter::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.DEBUG_SetShowAimDistance
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_DEBUG_SetShowAimDistance final
{
public:
	bool                                          _is_showed;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_DEBUG_SetShowAimDistance) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_DEBUG_SetShowAimDistance");
static_assert(sizeof(BattlePlayerControllerBase_DEBUG_SetShowAimDistance) == 0x000001, "Wrong size on BattlePlayerControllerBase_DEBUG_SetShowAimDistance");
static_assert(offsetof(BattlePlayerControllerBase_DEBUG_SetShowAimDistance, _is_showed) == 0x000000, "Member 'BattlePlayerControllerBase_DEBUG_SetShowAimDistance::_is_showed' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.GetLastPurchaseHistory
// 0x0030 (0x0030 - 0x0000)
struct BattlePlayerControllerBase_GetLastPurchaseHistory final
{
public:
	struct FItemID                                _item_id;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBattleStoreHistory                    ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_GetLastPurchaseHistory) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_GetLastPurchaseHistory");
static_assert(sizeof(BattlePlayerControllerBase_GetLastPurchaseHistory) == 0x000030, "Wrong size on BattlePlayerControllerBase_GetLastPurchaseHistory");
static_assert(offsetof(BattlePlayerControllerBase_GetLastPurchaseHistory, _item_id) == 0x000000, "Member 'BattlePlayerControllerBase_GetLastPurchaseHistory::_item_id' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_GetLastPurchaseHistory, ReturnValue) == 0x000010, "Member 'BattlePlayerControllerBase_GetLastPurchaseHistory::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.GetMinimapRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_GetMinimapRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_GetMinimapRenderTarget) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_GetMinimapRenderTarget");
static_assert(sizeof(BattlePlayerControllerBase_GetMinimapRenderTarget) == 0x000008, "Wrong size on BattlePlayerControllerBase_GetMinimapRenderTarget");
static_assert(offsetof(BattlePlayerControllerBase_GetMinimapRenderTarget, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_GetMinimapRenderTarget::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.GetNextAllySpectator
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_GetNextAllySpectator final
{
public:
	const class AActor*                           ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_GetNextAllySpectator) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_GetNextAllySpectator");
static_assert(sizeof(BattlePlayerControllerBase_GetNextAllySpectator) == 0x000008, "Wrong size on BattlePlayerControllerBase_GetNextAllySpectator");
static_assert(offsetof(BattlePlayerControllerBase_GetNextAllySpectator, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_GetNextAllySpectator::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.IsChangeMasterUIOpened
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_IsChangeMasterUIOpened final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_IsChangeMasterUIOpened) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_IsChangeMasterUIOpened");
static_assert(sizeof(BattlePlayerControllerBase_IsChangeMasterUIOpened) == 0x000001, "Wrong size on BattlePlayerControllerBase_IsChangeMasterUIOpened");
static_assert(offsetof(BattlePlayerControllerBase_IsChangeMasterUIOpened, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_IsChangeMasterUIOpened::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnALL_ChangeActionSetting
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_OnALL_ChangeActionSetting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnALL_ChangeActionSetting) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_OnALL_ChangeActionSetting");
static_assert(sizeof(BattlePlayerControllerBase_OnALL_ChangeActionSetting) == 0x000001, "Wrong size on BattlePlayerControllerBase_OnALL_ChangeActionSetting");
static_assert(offsetof(BattlePlayerControllerBase_OnALL_ChangeActionSetting, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_OnALL_ChangeActionSetting::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnALL_Damaged
// 0x0038 (0x0038 - 0x0000)
struct BattlePlayerControllerBase_OnALL_Damaged final
{
public:
	struct FDamagedData                           _data;                                             // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3E[0x7];                                     // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BattlePlayerControllerBase_OnALL_Damaged) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnALL_Damaged");
static_assert(sizeof(BattlePlayerControllerBase_OnALL_Damaged) == 0x000038, "Wrong size on BattlePlayerControllerBase_OnALL_Damaged");
static_assert(offsetof(BattlePlayerControllerBase_OnALL_Damaged, _data) == 0x000000, "Member 'BattlePlayerControllerBase_OnALL_Damaged::_data' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnALL_Damaged, ReturnValue) == 0x000030, "Member 'BattlePlayerControllerBase_OnALL_Damaged::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnALL_Respawn
// 0x0030 (0x0030 - 0x0000)
struct BattlePlayerControllerBase_OnALL_Respawn final
{
public:
	struct FVector                                _loc;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               _Rot;                                              // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnALL_Respawn) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnALL_Respawn");
static_assert(sizeof(BattlePlayerControllerBase_OnALL_Respawn) == 0x000030, "Wrong size on BattlePlayerControllerBase_OnALL_Respawn");
static_assert(offsetof(BattlePlayerControllerBase_OnALL_Respawn, _loc) == 0x000000, "Member 'BattlePlayerControllerBase_OnALL_Respawn::_loc' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnALL_Respawn, _Rot) == 0x000018, "Member 'BattlePlayerControllerBase_OnALL_Respawn::_Rot' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnCLIENT_BattleResult
// 0x00D8 (0x00D8 - 0x0000)
struct BattlePlayerControllerBase_OnCLIENT_BattleResult final
{
public:
	struct FBattleDecisionDetail                  _result;                                           // 0x0000(0x00D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3F[0x7];                                     // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BattlePlayerControllerBase_OnCLIENT_BattleResult) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnCLIENT_BattleResult");
static_assert(sizeof(BattlePlayerControllerBase_OnCLIENT_BattleResult) == 0x0000D8, "Wrong size on BattlePlayerControllerBase_OnCLIENT_BattleResult");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_BattleResult, _result) == 0x000000, "Member 'BattlePlayerControllerBase_OnCLIENT_BattleResult::_result' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_BattleResult, ReturnValue) == 0x0000D0, "Member 'BattlePlayerControllerBase_OnCLIENT_BattleResult::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnCLIENT_ChangeBattlePhase
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase final
{
public:
	EBattleModePhase                              _phase;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase");
static_assert(sizeof(BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase) == 0x000001, "Wrong size on BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase, _phase) == 0x000000, "Member 'BattlePlayerControllerBase_OnCLIENT_ChangeBattlePhase::_phase' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnCLIENT_Hit
// 0x00B0 (0x00B0 - 0x0000)
struct BattlePlayerControllerBase_OnCLIENT_Hit final
{
public:
	struct FHitData                               _hit;                                              // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F40[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BattlePlayerControllerBase_OnCLIENT_Hit) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnCLIENT_Hit");
static_assert(sizeof(BattlePlayerControllerBase_OnCLIENT_Hit) == 0x0000B0, "Wrong size on BattlePlayerControllerBase_OnCLIENT_Hit");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_Hit, _hit) == 0x000000, "Member 'BattlePlayerControllerBase_OnCLIENT_Hit::_hit' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_Hit, ReturnValue) == 0x0000A8, "Member 'BattlePlayerControllerBase_OnCLIENT_Hit::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnCLIENT_ShowResult
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_OnCLIENT_ShowResult final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnCLIENT_ShowResult) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_OnCLIENT_ShowResult");
static_assert(sizeof(BattlePlayerControllerBase_OnCLIENT_ShowResult) == 0x000001, "Wrong size on BattlePlayerControllerBase_OnCLIENT_ShowResult");
static_assert(offsetof(BattlePlayerControllerBase_OnCLIENT_ShowResult, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_OnCLIENT_ShowResult::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnKillLog
// 0x0030 (0x0030 - 0x0000)
struct BattlePlayerControllerBase_OnKillLog final
{
public:
	struct FKillLog                               _log;                                              // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F41[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BattlePlayerControllerBase_OnKillLog) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnKillLog");
static_assert(sizeof(BattlePlayerControllerBase_OnKillLog) == 0x000030, "Wrong size on BattlePlayerControllerBase_OnKillLog");
static_assert(offsetof(BattlePlayerControllerBase_OnKillLog, _log) == 0x000000, "Member 'BattlePlayerControllerBase_OnKillLog::_log' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnKillLog, ReturnValue) == 0x000028, "Member 'BattlePlayerControllerBase_OnKillLog::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnSERVER_Died
// 0x00B0 (0x00B0 - 0x0000)
struct BattlePlayerControllerBase_OnSERVER_Died final
{
public:
	struct FHitData                               _last_hit_data;                                    // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F42[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])
};
static_assert(alignof(BattlePlayerControllerBase_OnSERVER_Died) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_OnSERVER_Died");
static_assert(sizeof(BattlePlayerControllerBase_OnSERVER_Died) == 0x0000B0, "Wrong size on BattlePlayerControllerBase_OnSERVER_Died");
static_assert(offsetof(BattlePlayerControllerBase_OnSERVER_Died, _last_hit_data) == 0x000000, "Member 'BattlePlayerControllerBase_OnSERVER_Died::_last_hit_data' has a wrong offset!");
static_assert(offsetof(BattlePlayerControllerBase_OnSERVER_Died, ReturnValue) == 0x0000A8, "Member 'BattlePlayerControllerBase_OnSERVER_Died::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnShowResult
// 0x0001 (0x0001 - 0x0000)
struct BattlePlayerControllerBase_OnShowResult final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnShowResult) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_OnShowResult");
static_assert(sizeof(BattlePlayerControllerBase_OnShowResult) == 0x000001, "Wrong size on BattlePlayerControllerBase_OnShowResult");
static_assert(offsetof(BattlePlayerControllerBase_OnShowResult, ReturnValue) == 0x000000, "Member 'BattlePlayerControllerBase_OnShowResult::ReturnValue' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnShowRoundResult
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_OnShowRoundResult final
{
public:
	struct FRoundResult                           _result;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnShowRoundResult) == 0x000004, "Wrong alignment on BattlePlayerControllerBase_OnShowRoundResult");
static_assert(sizeof(BattlePlayerControllerBase_OnShowRoundResult) == 0x000008, "Wrong size on BattlePlayerControllerBase_OnShowRoundResult");
static_assert(offsetof(BattlePlayerControllerBase_OnShowRoundResult, _result) == 0x000000, "Member 'BattlePlayerControllerBase_OnShowRoundResult::_result' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.OnShowRoundStart
// 0x000C (0x000C - 0x0000)
struct BattlePlayerControllerBase_OnShowRoundStart final
{
public:
	struct FRoundStartNotify                      _notify;                                           // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_OnShowRoundStart) == 0x000004, "Wrong alignment on BattlePlayerControllerBase_OnShowRoundStart");
static_assert(sizeof(BattlePlayerControllerBase_OnShowRoundStart) == 0x00000C, "Wrong size on BattlePlayerControllerBase_OnShowRoundStart");
static_assert(offsetof(BattlePlayerControllerBase_OnShowRoundStart, _notify) == 0x000000, "Member 'BattlePlayerControllerBase_OnShowRoundStart::_notify' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.RemoveFullScreenWidget
// 0x0008 (0x0008 - 0x0000)
struct BattlePlayerControllerBase_RemoveFullScreenWidget final
{
public:
	class UWidget*                                _widget;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_RemoveFullScreenWidget) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_RemoveFullScreenWidget");
static_assert(sizeof(BattlePlayerControllerBase_RemoveFullScreenWidget) == 0x000008, "Wrong size on BattlePlayerControllerBase_RemoveFullScreenWidget");
static_assert(offsetof(BattlePlayerControllerBase_RemoveFullScreenWidget, _widget) == 0x000000, "Member 'BattlePlayerControllerBase_RemoveFullScreenWidget::_widget' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.RPC_ALL_DEBUG_Slomo
// 0x0004 (0x0004 - 0x0000)
struct BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo final
{
public:
	int32                                         _slomo;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo) == 0x000004, "Wrong alignment on BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo");
static_assert(sizeof(BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo) == 0x000004, "Wrong size on BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo");
static_assert(offsetof(BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo, _slomo) == 0x000000, "Member 'BattlePlayerControllerBase_RPC_ALL_DEBUG_Slomo::_slomo' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.RPC_CLIENT_BattleResult
// 0x00D0 (0x00D0 - 0x0000)
struct BattlePlayerControllerBase_RPC_CLIENT_BattleResult final
{
public:
	struct FBattleDecisionDetail                  _result;                                           // 0x0000(0x00D0)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_RPC_CLIENT_BattleResult) == 0x000008, "Wrong alignment on BattlePlayerControllerBase_RPC_CLIENT_BattleResult");
static_assert(sizeof(BattlePlayerControllerBase_RPC_CLIENT_BattleResult) == 0x0000D0, "Wrong size on BattlePlayerControllerBase_RPC_CLIENT_BattleResult");
static_assert(offsetof(BattlePlayerControllerBase_RPC_CLIENT_BattleResult, _result) == 0x000000, "Member 'BattlePlayerControllerBase_RPC_CLIENT_BattleResult::_result' has a wrong offset!");

// Function Stigma.BattlePlayerControllerBase.RPC_CLIENT_ChangeMasterMessage
// 0x0002 (0x0002 - 0x0000)
struct BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage final
{
public:
	bool                                          _is_enable_change;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharaType                                    _change_chara_type;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage) == 0x000001, "Wrong alignment on BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage");
static_assert(sizeof(BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage) == 0x000002, "Wrong size on BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage");
static_assert(offsetof(BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage, _is_enable_change) == 0x000000, "Member 'BattlePlayerControllerBase_RPC_CLIENT_ChangeMasterMessage::_is_enable_change' has a wrong offset!");
