#pragma once

/*
* SDK generated by Dumper-69
*
* https://github.com/Encryqed/Dumper-69
*/

// Package: Stigma

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Stigma_structs.hpp"
#include "InputCore_structs.hpp"
#include "BPGLib_structs.hpp"
#include "BPGLib_classes.hpp"
#include "Niagara_classes.hpp"
#include "ActionGraph_structs.hpp"
#include "ActionGraph_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "Minimap_classes.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "BPMotionCore_classes.hpp"
#include "PhysicsCore_classes.hpp"
#include "CommonUI_classes.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK
{

// Class Stigma.StigmaPlayerController
// 0x00D8 (0x0990 - 0x08B8)
class AStigmaPlayerController : public ABPGPlayerController
{
public:
	TSubclassOf<class UUI_ToastMessageContainerBase> _ToastMessageContainerClass;                       // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_ToastMessageContainerBase*          _ToastMessageContainer;                            // 0x08C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTickTaskComponent*                     _TickTaskComponent;                                // 0x08C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_RewardedPopup>          _RewardedUIClass;                                  // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F24[0x90];                                    // 0x08D8(0x0090)(Fixing Size After Last Property [ Dumper-69 ])
	class AVoiceSound2DActor*                     _Announcer2DActor;                                 // 0x0968(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AVoiceSound2DActor*>             _CharacterVoice2DActors;                           // 0x0970(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UUI_GameNotifyContainer*                _GameNotifyContainer;                              // 0x0980(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_ShopQuickPurchase>      _QuickPurchaseUIClass;                             // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddChara2DVoice(const class FString& _voice_id, class APlayerState* _player_state, ECharaType _speak_chara_type, bool _is_radio);
	void AddGameNotify(const class FName& _notify_name, const class FText& _text, float _time);
	void AddTickTask(float _duration, const TDelegate<void(float _delta, float _elaped, ETickTaskState _state)>& _task);
	void AddVoice(const class FString& _voice_id, class ACharaBase* _speak_chara, bool _is_3d_voice);
	void ClearAllGameNotifies();
	void HideAllGameNotifies(bool _hide);
	void MapJump(class FName _level_name, float _fadeout_time);
	void OnEnterChatAction();
	void PlayVoice();
	void RemoveGameNotify(const class FName& _notify_name, bool _force_remove);
	void ShowQuickPurchaseCurrencyPopup(const struct FItemID_Currency& _currency_id);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StigmaPlayerController">();
	}
	static class AStigmaPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStigmaPlayerController>();
	}
};
static_assert(alignof(AStigmaPlayerController) == 0x000008, "Wrong alignment on AStigmaPlayerController");
static_assert(sizeof(AStigmaPlayerController) == 0x000990, "Wrong size on AStigmaPlayerController");
static_assert(offsetof(AStigmaPlayerController, _ToastMessageContainerClass) == 0x0008B8, "Member 'AStigmaPlayerController::_ToastMessageContainerClass' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _ToastMessageContainer) == 0x0008C0, "Member 'AStigmaPlayerController::_ToastMessageContainer' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _TickTaskComponent) == 0x0008C8, "Member 'AStigmaPlayerController::_TickTaskComponent' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _RewardedUIClass) == 0x0008D0, "Member 'AStigmaPlayerController::_RewardedUIClass' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _Announcer2DActor) == 0x000968, "Member 'AStigmaPlayerController::_Announcer2DActor' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _CharacterVoice2DActors) == 0x000970, "Member 'AStigmaPlayerController::_CharacterVoice2DActors' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _GameNotifyContainer) == 0x000980, "Member 'AStigmaPlayerController::_GameNotifyContainer' has a wrong offset!");
static_assert(offsetof(AStigmaPlayerController, _QuickPurchaseUIClass) == 0x000988, "Member 'AStigmaPlayerController::_QuickPurchaseUIClass' has a wrong offset!");

// Class Stigma.MatchServicedPlayerController
// 0x0028 (0x09B8 - 0x0990)
class AMatchServicedPlayerController : public AStigmaPlayerController
{
public:
	uint8                                         Pad_1F29[0x8];                                     // 0x0990(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	struct FNetID                                 _NetID;                                            // 0x0998(0x0002)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F2A[0x6];                                     // 0x099A(0x0006)(Fixing Size After Last Property [ Dumper-69 ])
	FMulticastInlineDelegateProperty_             _OnConfirm_ACK;                                    // 0x09A0(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, Protected, BlueprintCallable, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F2B[0x8];                                     // 0x09B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	void ExitToLobby();
	bool OnChangeServerState(EServerStatus _server_state);
	void OnClient_UpdateSharedPlayerState(class AMatchServicedPlayerState* _player_state);
	void OnRep_NetID(const struct FNetID& _old_id);
	void QuitToLobby();
	void RPC_CLI_SendChat(const struct FChatMsg& _msg);
	void RPC_CLIENT_Quit_ACK();
	void RPC_CLIENT_TryReady_ACK(const struct FConfirmResponse& _response);
	void RPC_CLIENT_WarnChangingGun(ECharaType _chara_type, const struct FGunPreset& _gun_preset);
	void RPC_DEBUG_FinishBattle();
	void RPC_SERVER_ConfirmEndSession();
	void RPC_SERVER_Quit();
	void RPC_SERVER_SendChat(const struct FChatMsg& _msg);
	void RPC_SERVER_SetCharacterSetting(int32 _zidx_chara, const struct FItemID& _item_id, int32 _slot_zidx);
	void RPC_SERVER_SetCostume(const TArray<struct FLocalCharacterSet>& _local_picked_charas, int32 _zidx_chara, const struct FItemID& _item_id);
	void RPC_SERVER_SetGunPreset(const TArray<struct FLocalCharacterSet>& _local_picked_charas, int32 _zidx_chara, const struct FGunPreset& _gun_preset);
	void RPC_SERVER_TryReady(const TArray<struct FLocalCharacterSet>& _local_picked_charas, bool _i_am_ready, bool _forced);
	void RPC_SERVER_UpdateBooster(int32 _slot_index, const struct FItemID& _item_id);
	void RPC_SERVER_UpdateInvenByItems();
	void SERVER_SetNetID(const struct FNetID& _net_id);
	void Setter_NetID(const struct FNetID& _new_id);
	void ShowRewardedPopup(const struct FRewardPlain& _reward_plain);

	const struct FCharacterInfo GetCurrentCharacterInfo() const;
	struct FNetID GetNetID() const;
	class ACharaBase* GetOwnCharacter() const;
	ETeams GetTeam() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MatchServicedPlayerController">();
	}
	static class AMatchServicedPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatchServicedPlayerController>();
	}
};
static_assert(alignof(AMatchServicedPlayerController) == 0x000008, "Wrong alignment on AMatchServicedPlayerController");
static_assert(sizeof(AMatchServicedPlayerController) == 0x0009B8, "Wrong size on AMatchServicedPlayerController");
static_assert(offsetof(AMatchServicedPlayerController, _NetID) == 0x000998, "Member 'AMatchServicedPlayerController::_NetID' has a wrong offset!");
static_assert(offsetof(AMatchServicedPlayerController, _OnConfirm_ACK) == 0x0009A0, "Member 'AMatchServicedPlayerController::_OnConfirm_ACK' has a wrong offset!");

// Class Stigma.BattlePlayerControllerBase
// 0x0488 (0x0E40 - 0x09B8)
class ABattlePlayerControllerBase : public AMatchServicedPlayerController
{
public:
	TSubclassOf<class UUI_HUDBase>                HUD_Type;                                          // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_ResultBase>             ResultUI_Type;                                     // 0x09C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_TabBase>                TabUI_Type;                                        // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_RoundResultBase>        RoundResultUI_Type;                                // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_HUDBase*                            UI_HUD;                                            // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_ResultBase*                         UI_Result;                                         // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_RoundResultBase*                    UI_RoundResult;                                    // 0x09E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_TabBase*                            UI_Tab;                                            // 0x09F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPopupBase*                             UI_Help;                                           // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPopupBase*                             UI_WaitingRoom_InGame;                             // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPopupBase>                 HelpUI_Type;                                       // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UPopupBase>                 WaitingRoomUI_Type;                                // 0x0A10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UWorld>                  CharacterPickInGameMapFile;                        // 0x0A18(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraShakeBase>           Shake_Strong;                                      // 0x0A40(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraShakeBase>           Shake_Weak;                                        // 0x0A48(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UCameraShakeBase>           Shake_OnFire;                                      // 0x0A50(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_CheatBase>              UICheatType;                                       // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_CheatBase*                          UI_Cheat;                                          // 0x0A60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserOption*                            _UserOption;                                       // 0x0A68(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetComponent*                       _MinimapWidget;                                    // 0x0A70(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F33[0x8];                                     // 0x0A78(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<class UWidget*>                        _WidgetsToAddToHUD;                                // 0x0A80(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDominantPopupUIOption                 DominantPopupUIOption;                             // 0x0A90(0x0010)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class ACharaBase*                             _UIBoundChara;                                     // 0x0AA0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F34[0x1];                                     // 0x0AA8(0x0001)(Fixing Size After Last Property [ Dumper-69 ])
	bool                                          _IsBattleStoreEnabled;                             // 0x0AA9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          _CanOpenBattleStore;                               // 0x0AAA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F35[0x5];                                     // 0x0AAB(0x0005)(Fixing Size After Last Property [ Dumper-69 ])
	TSet<EBattleStoreTab>                         _BattleStoreTabs;                                  // 0x0AB0(0x0050)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UUI_BattleStorePopup>       _BattleStoreUI_Type;                               // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUI_BattleStorePopup*                   _BattleStoreUI;                                    // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBattleStoreHistoryRecorder            _BattleStoreHistoryRecorder;                       // 0x0B10(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             Event_OnUpdateBattleStore;                         // 0x0B70(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	struct FRoundResult                           _LastRoundResult;                                  // 0x0B80(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F36[0x20];                                    // 0x0B88(0x0020)(Fixing Size After Last Property [ Dumper-69 ])
	TSubclassOf<class UUserWidget>                _DEBUG_ShowAimDistanceWidgetClass;                 // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            _DEBUG_ShowAimDistanceWidget;                      // 0x0BB0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UKillcamPlayback*                       _KillCam;                                          // 0x0BB8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F37[0x10];                                    // 0x0BC0(0x0010)(Fixing Size After Last Property [ Dumper-69 ])
	class UUI_ActionWheelMenu*                    _ActionWheelMenu;                                  // 0x0BD0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F38[0x20];                                    // 0x0BD8(0x0020)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<class UAutoBoosterTrigger*>            _AutoBoosters;                                     // 0x0BF8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ALevelSequenceActor*                    _Outro_Sequencer;                                  // 0x0C08(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F39[0x160];                                   // 0x0C10(0x0160)(Fixing Size After Last Property [ Dumper-69 ])
	class ULevelSequencePlayer*                   _CutScenePlayer;                                   // 0x0D70(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULevelStreamingDynamic*                 _Level_Outro;                                      // 0x0D78(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F3A[0x8];                                     // 0x0D80(0x0008)(Fixing Size After Last Property [ Dumper-69 ])
	TSubclassOf<class UUserWidget>                UI_Outro;                                          // 0x0D88(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULevelStreamingDynamic*                 _Level_CharacterPick;                              // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPOPUP_ChangeMaster*                    _UI_ChangeMaster;                                  // 0x0D98(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ACameraActor>               _PreloadCamera;                                    // 0x0DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACameraActor*                           _CachedPreloadCamera;                              // 0x0DA8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UNiagaraComponent*>              _SpawnedPreloadFX;                                 // 0x0DB0(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 _PrevViewTarget;                                   // 0x0DC0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F3B[0x60];                                    // 0x0DC8(0x0060)(Fixing Size After Last Property [ Dumper-69 ])
	FMulticastInlineDelegateProperty_             OnPreloadWarmUpComplete;                           // 0x0E28(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F3C[0x8];                                     // 0x0E38(0x0008)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	void AddChatActiveFunctions();
	void AddChatIfCanToggleSight();
	void AddFullScreenWidget(class UWidget* _widget);
	void AddToastAndChatIfCanToggleSight();
	void AddToastIfCanToggleSight();
	void AddToastIfLackControlPower(class AGunBase* _gun);
	void CloseBattleStorePopup();
	class ACharaBase* DEBUG_CreateNewCharacter(ECharaType _type, EGunType _gun_type);
	void DEBUG_PlaceOverlappedLocation();
	void DEBUG_SetShowAimDistance(bool _is_showed);
	struct FBattleStoreHistory GetLastPurchaseHistory(const struct FItemID& _item_id);
	class UTextureRenderTarget2D* GetMinimapRenderTarget();
	const class AActor* GetNextAllySpectator();
	bool IsChangeMasterUIOpened();
	void OnActionWheelCanceled();
	bool OnALL_ChangeActionSetting();
	bool OnALL_Damaged(const struct FDamagedData& _data);
	void OnALL_Respawn(const struct FVector& _loc, const struct FRotator& _Rot);
	bool OnCLIENT_BattleResult(const struct FBattleDecisionDetail& _result);
	void OnCLIENT_ChangeBattlePhase(EBattleModePhase _phase);
	bool OnCLIENT_Hit(const struct FHitData& _hit);
	bool OnCLIENT_ShowResult();
	void OnCloseCharacterPick();
	bool OnKillLog(const struct FKillLog& _log);
	bool OnSERVER_Died(const struct FHitData& _last_hit_data);
	bool OnShowResult();
	void OnShowRoundResult(const struct FRoundResult& _result);
	void OnShowRoundStart(const struct FRoundStartNotify& _notify);
	void PlayKillcam();
	void RemoveFullScreenWidget(class UWidget* _widget);
	void RPC_ALL_DEBUG_Slomo(int32 _slomo);
	void RPC_CLIENT_BattleResult(const struct FBattleDecisionDetail& _result);
	void RPC_CLIENT_ChangeMasterMessage(bool _is_enable_change, ECharaType _change_chara_type);
	void RPC_CLIENT_Command_Stat_Startfile_ACK();
	void RPC_CLIENT_Command_Stat_Stopfile_ACK();
	void RPC_CLIENT_DEBUG_MissionProgress(const struct FItemID& _task_id, const struct FItemID_Mission& _mission_id, int32 _count);
	void RPC_CLIENT_Emoticon(const struct FEmoticonData& _emoticon);
	void RPC_CLIENT_KillerInfo(const class ACharaBase* _killer, const class ACharaBase* _victim);
	void RPC_CLIENT_KillLog(const struct FNetKillLog& _log);
	void RPC_CLIENT_KillStreak(const TArray<EKillStreak>& _streaks);
	void RPC_CLIENT_MissionSuccess(const struct FItemID_Mission& _mission_id);
	void RPC_CLIENT_OnGetIngameMoney(int32 _inc_money, EGoldRewardType _reward_type);
	void RPC_CLIENT_Ping(const struct FPingData& _ping);
	void RPC_CLIENT_RechargeArmor(float _inc_armor_rate);
	void RPC_CLIENT_Refund_Item_ACK(bool _is_success, const struct FBattleStoreHistory& _history);
	void RPC_CLIENT_RequestClearBattleStoreHistory();
	void RPC_CLIENT_RequestPurchase_BattleStore_ACK(bool _is_success, const struct FItemID& _item_id, const struct FBattleStoreHistory& _history);
	void RPC_Client_Revive_Alert(class ACharaBase* _revived_chara, class ACharaBase* _saver_chara);
	void RPC_CLIENT_RoundStart(const struct FRoundStartNotify& _notify);
	void RPC_CLIENT_SendRadioChat(const struct FUserID& _speacker_user_id, const struct FRadioChatID& _radio_chat_id);
	void RPC_CLIENT_StartChangeMaster();
	void RPC_SERVER_ChangeSpectator();
	void RPC_SERVER_Command_Stat_Startfile();
	void RPC_SERVER_Command_Stat_Stopfile();
	void RPC_SERVER_DEBUG_AddAI(const class FString& _nickname, ETeams _Team, ECharaType _chara_type, EArmorType _armor_type, EGunType _gun_type, const struct FAI_Characteristic& _characteristic);
	void RPC_SERVER_DEBUG_Change_Gun();
	void RPC_SERVER_DEBUG_ChangeCharacterType(ECharaType _chara_type);
	void RPC_SERVER_DEBUG_MakeSpectator();
	void RPC_SERVER_DEBUG_Slomo(int32 _slomo);
	void RPC_SERVER_PleaseChangeMaster(ECharaType _new_chara_type);
	void RPC_SERVER_Refund_Item(const struct FBattleStoreHistory& _history);
	void RPC_SERVER_RequestChangeMaster();
	void RPC_SERVER_RequestClearBattleStoreHistory();
	void RPC_SERVER_RequestEmoticon(const struct FEmoticonData& _emoticon);
	void RPC_SERVER_RequestPing(const struct FPingData& _ping);
	void RPC_SERVER_RequestPurchase_BattleStore(const struct FItemID& _item_id, int32 _params);
	void RPC_SERVER_RequestRadioChat(const struct FRadioChatID& _radio_chat_id);
	void RPC_SERVER_RespawnInPlace();
	void RPC_SERVER_ResumeRespawn();
	void RPC_SERVER_SpectateCCTV(int32 _idx);
	void RPC_SERVER_SpectatePlayer(ETeams _Team, int32 _idx);
	void RPC_SERVER_UpdatePlayerFPS(uint8 _fps);
	bool SetInteractionProgressBar(bool _visible, float _duration);
	void ShowHelpUI(bool _show);
	void ShowHUD(bool _is_visible, class UObject* _caller);
	void ShowMissionArea(const class FString& _area_name, bool _show);
	void ShowTabUI(bool _show);
	void StopKillcam();

	float CLIENT_GetDeviationAngle(float _deviation) const;
	bool DEBUG_GetShowAimDistance() const;
	class ACharaBase* GetChara() const;
	ECharaType GetCharacterType() const;
	class ACharaBase* GetCurrentTargetChara() const;
	const struct FRoundResult GetLastRoundResult() const;
	void GetLookAtRay(float _distance, struct FVector* _start, struct FVector* _end) const;
	float GetRadioChatCooltime() const;
	int32 GetRadioChatStock() const;
	bool IsBattleStoreOpened() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattlePlayerControllerBase">();
	}
	static class ABattlePlayerControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattlePlayerControllerBase>();
	}
};
static_assert(alignof(ABattlePlayerControllerBase) == 0x000008, "Wrong alignment on ABattlePlayerControllerBase");
static_assert(sizeof(ABattlePlayerControllerBase) == 0x000E40, "Wrong size on ABattlePlayerControllerBase");
static_assert(offsetof(ABattlePlayerControllerBase, HUD_Type) == 0x0009B8, "Member 'ABattlePlayerControllerBase::HUD_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, ResultUI_Type) == 0x0009C0, "Member 'ABattlePlayerControllerBase::ResultUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, TabUI_Type) == 0x0009C8, "Member 'ABattlePlayerControllerBase::TabUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, RoundResultUI_Type) == 0x0009D0, "Member 'ABattlePlayerControllerBase::RoundResultUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_HUD) == 0x0009D8, "Member 'ABattlePlayerControllerBase::UI_HUD' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_Result) == 0x0009E0, "Member 'ABattlePlayerControllerBase::UI_Result' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_RoundResult) == 0x0009E8, "Member 'ABattlePlayerControllerBase::UI_RoundResult' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_Tab) == 0x0009F0, "Member 'ABattlePlayerControllerBase::UI_Tab' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_Help) == 0x0009F8, "Member 'ABattlePlayerControllerBase::UI_Help' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_WaitingRoom_InGame) == 0x000A00, "Member 'ABattlePlayerControllerBase::UI_WaitingRoom_InGame' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, HelpUI_Type) == 0x000A08, "Member 'ABattlePlayerControllerBase::HelpUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, WaitingRoomUI_Type) == 0x000A10, "Member 'ABattlePlayerControllerBase::WaitingRoomUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, CharacterPickInGameMapFile) == 0x000A18, "Member 'ABattlePlayerControllerBase::CharacterPickInGameMapFile' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, Shake_Strong) == 0x000A40, "Member 'ABattlePlayerControllerBase::Shake_Strong' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, Shake_Weak) == 0x000A48, "Member 'ABattlePlayerControllerBase::Shake_Weak' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, Shake_OnFire) == 0x000A50, "Member 'ABattlePlayerControllerBase::Shake_OnFire' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UICheatType) == 0x000A58, "Member 'ABattlePlayerControllerBase::UICheatType' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_Cheat) == 0x000A60, "Member 'ABattlePlayerControllerBase::UI_Cheat' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _UserOption) == 0x000A68, "Member 'ABattlePlayerControllerBase::_UserOption' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _MinimapWidget) == 0x000A70, "Member 'ABattlePlayerControllerBase::_MinimapWidget' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _WidgetsToAddToHUD) == 0x000A80, "Member 'ABattlePlayerControllerBase::_WidgetsToAddToHUD' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, DominantPopupUIOption) == 0x000A90, "Member 'ABattlePlayerControllerBase::DominantPopupUIOption' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _UIBoundChara) == 0x000AA0, "Member 'ABattlePlayerControllerBase::_UIBoundChara' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _IsBattleStoreEnabled) == 0x000AA9, "Member 'ABattlePlayerControllerBase::_IsBattleStoreEnabled' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _CanOpenBattleStore) == 0x000AAA, "Member 'ABattlePlayerControllerBase::_CanOpenBattleStore' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _BattleStoreTabs) == 0x000AB0, "Member 'ABattlePlayerControllerBase::_BattleStoreTabs' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _BattleStoreUI_Type) == 0x000B00, "Member 'ABattlePlayerControllerBase::_BattleStoreUI_Type' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _BattleStoreUI) == 0x000B08, "Member 'ABattlePlayerControllerBase::_BattleStoreUI' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _BattleStoreHistoryRecorder) == 0x000B10, "Member 'ABattlePlayerControllerBase::_BattleStoreHistoryRecorder' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, Event_OnUpdateBattleStore) == 0x000B70, "Member 'ABattlePlayerControllerBase::Event_OnUpdateBattleStore' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _LastRoundResult) == 0x000B80, "Member 'ABattlePlayerControllerBase::_LastRoundResult' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _DEBUG_ShowAimDistanceWidgetClass) == 0x000BA8, "Member 'ABattlePlayerControllerBase::_DEBUG_ShowAimDistanceWidgetClass' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _DEBUG_ShowAimDistanceWidget) == 0x000BB0, "Member 'ABattlePlayerControllerBase::_DEBUG_ShowAimDistanceWidget' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _KillCam) == 0x000BB8, "Member 'ABattlePlayerControllerBase::_KillCam' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _ActionWheelMenu) == 0x000BD0, "Member 'ABattlePlayerControllerBase::_ActionWheelMenu' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _AutoBoosters) == 0x000BF8, "Member 'ABattlePlayerControllerBase::_AutoBoosters' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _Outro_Sequencer) == 0x000C08, "Member 'ABattlePlayerControllerBase::_Outro_Sequencer' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _CutScenePlayer) == 0x000D70, "Member 'ABattlePlayerControllerBase::_CutScenePlayer' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _Level_Outro) == 0x000D78, "Member 'ABattlePlayerControllerBase::_Level_Outro' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, UI_Outro) == 0x000D88, "Member 'ABattlePlayerControllerBase::UI_Outro' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _Level_CharacterPick) == 0x000D90, "Member 'ABattlePlayerControllerBase::_Level_CharacterPick' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _UI_ChangeMaster) == 0x000D98, "Member 'ABattlePlayerControllerBase::_UI_ChangeMaster' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _PreloadCamera) == 0x000DA0, "Member 'ABattlePlayerControllerBase::_PreloadCamera' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _CachedPreloadCamera) == 0x000DA8, "Member 'ABattlePlayerControllerBase::_CachedPreloadCamera' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _SpawnedPreloadFX) == 0x000DB0, "Member 'ABattlePlayerControllerBase::_SpawnedPreloadFX' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, _PrevViewTarget) == 0x000DC0, "Member 'ABattlePlayerControllerBase::_PrevViewTarget' has a wrong offset!");
static_assert(offsetof(ABattlePlayerControllerBase, OnPreloadWarmUpComplete) == 0x000E28, "Member 'ABattlePlayerControllerBase::OnPreloadWarmUpComplete' has a wrong offset!");

// Class Stigma.TrainingRoomPlayerController
// 0x0190 (0x0FD0 - 0x0E40)
class ATrainingRoomPlayerController : public ABattlePlayerControllerBase
{
public:
	struct FHitResult                             _PointingTarget;                                   // 0x0E40(0x00E8)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F4E[0xA8];                                    // 0x0F28(0x00A8)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	void OnMatchChanged();
	bool OnPointingActor(class AActor* _Actor);
	void OpenBattleStore_ChangeGunPopup();
	void RPC_CLIENT_ResetStockAndCooltime();
	void RPC_SERVER_ResetStockAndCooltime();

	class AActor* GetPointingTargetActor() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrainingRoomPlayerController">();
	}
	static class ATrainingRoomPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrainingRoomPlayerController>();
	}
};
static_assert(alignof(ATrainingRoomPlayerController) == 0x000008, "Wrong alignment on ATrainingRoomPlayerController");
static_assert(sizeof(ATrainingRoomPlayerController) == 0x000FD0, "Wrong size on ATrainingRoomPlayerController");
static_assert(offsetof(ATrainingRoomPlayerController, _PointingTarget) == 0x000E40, "Member 'ATrainingRoomPlayerController::_PointingTarget' has a wrong offset!");

// Class Stigma.AbnormalsBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsNone(const struct FAbnormals& _Flags);
	static bool IsSet(const struct FAbnormals& _Flags, EAbnormal _abnormal);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalsBlueprintLibrary">();
	}
	static class UAbnormalsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalsBlueprintLibrary>();
	}
};
static_assert(alignof(UAbnormalsBlueprintLibrary) == 0x000008, "Wrong alignment on UAbnormalsBlueprintLibrary");
static_assert(sizeof(UAbnormalsBlueprintLibrary) == 0x000028, "Wrong size on UAbnormalsBlueprintLibrary");

// Class Stigma.AISpawnVolume
// 0x0010 (0x02A8 - 0x0298)
class AAISpawnVolume final : public AActor
{
public:
	TArray<class AAIRoamingPointVolume*>          RoamingPointVolumeArray;                           // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	struct FVector GetRandomLocationInVolume() const;
	struct FVector GetRandomRoamingPoint() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AISpawnVolume">();
	}
	static class AAISpawnVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAISpawnVolume>();
	}
};
static_assert(alignof(AAISpawnVolume) == 0x000008, "Wrong alignment on AAISpawnVolume");
static_assert(sizeof(AAISpawnVolume) == 0x0002A8, "Wrong size on AAISpawnVolume");
static_assert(offsetof(AAISpawnVolume, RoamingPointVolumeArray) == 0x000298, "Member 'AAISpawnVolume::RoamingPointVolumeArray' has a wrong offset!");

// Class Stigma.ActionGraphNode_Specter
// 0x0040 (0x0260 - 0x0220)
class UActionGraphNode_Specter : public UActionGraphNode_Anim
{
public:
	bool                                          SyncStartTimeWithMate;                             // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionSource                                 MotionSource;                                      // 0x0221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AimOffset;                                         // 0x0222(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoveMode                                     StartMoveMode;                                     // 0x0223(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStopAllMontage;                                  // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLockTransformExceptRootMotion;                   // 0x0225(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F50[0x2];                                     // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         AngleLimit;                                        // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanPlayPassiveEvenIfLie;                           // 0x022C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F51[0x33];                                    // 0x022D(0x0033)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionGraphNode_Specter">();
	}
	static class UActionGraphNode_Specter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionGraphNode_Specter>();
	}
};
static_assert(alignof(UActionGraphNode_Specter) == 0x000010, "Wrong alignment on UActionGraphNode_Specter");
static_assert(sizeof(UActionGraphNode_Specter) == 0x000260, "Wrong size on UActionGraphNode_Specter");
static_assert(offsetof(UActionGraphNode_Specter, SyncStartTimeWithMate) == 0x000220, "Member 'UActionGraphNode_Specter::SyncStartTimeWithMate' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, MotionSource) == 0x000221, "Member 'UActionGraphNode_Specter::MotionSource' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, AimOffset) == 0x000222, "Member 'UActionGraphNode_Specter::AimOffset' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, StartMoveMode) == 0x000223, "Member 'UActionGraphNode_Specter::StartMoveMode' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, IsStopAllMontage) == 0x000224, "Member 'UActionGraphNode_Specter::IsStopAllMontage' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, IsLockTransformExceptRootMotion) == 0x000225, "Member 'UActionGraphNode_Specter::IsLockTransformExceptRootMotion' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, AngleLimit) == 0x000228, "Member 'UActionGraphNode_Specter::AngleLimit' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_Specter, CanPlayPassiveEvenIfLie) == 0x00022C, "Member 'UActionGraphNode_Specter::CanPlayPassiveEvenIfLie' has a wrong offset!");

// Class Stigma.ActionGraphNode_RandomAnim
// 0x0020 (0x0280 - 0x0260)
class UActionGraphNode_RandomAnim final : public UActionGraphNode_Specter
{
public:
	TArray<class UAnimSequenceBase*>              _AdditionalRandomAnims;                            // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UAnimSequenceBase*>              _Anims;                                            // 0x0270(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionGraphNode_RandomAnim">();
	}
	static class UActionGraphNode_RandomAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionGraphNode_RandomAnim>();
	}
};
static_assert(alignof(UActionGraphNode_RandomAnim) == 0x000010, "Wrong alignment on UActionGraphNode_RandomAnim");
static_assert(sizeof(UActionGraphNode_RandomAnim) == 0x000280, "Wrong size on UActionGraphNode_RandomAnim");
static_assert(offsetof(UActionGraphNode_RandomAnim, _AdditionalRandomAnims) == 0x000260, "Member 'UActionGraphNode_RandomAnim::_AdditionalRandomAnims' has a wrong offset!");
static_assert(offsetof(UActionGraphNode_RandomAnim, _Anims) == 0x000270, "Member 'UActionGraphNode_RandomAnim::_Anims' has a wrong offset!");

// Class Stigma.FocusDriver
// 0x0008 (0x0030 - 0x0028)
class UFocusDriver : public UObject
{
public:
	class AAdvancedAIController*                  _controller;                                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusDriver">();
	}
	static class UFocusDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusDriver>();
	}
};
static_assert(alignof(UFocusDriver) == 0x000008, "Wrong alignment on UFocusDriver");
static_assert(sizeof(UFocusDriver) == 0x000030, "Wrong size on UFocusDriver");
static_assert(offsetof(UFocusDriver, _controller) == 0x000028, "Member 'UFocusDriver::_controller' has a wrong offset!");

// Class Stigma.FocusDriver_Forward
// 0x0050 (0x0080 - 0x0030)
class UFocusDriver_Forward final : public UFocusDriver
{
public:
	struct FFocusInterp_FitInRange_Setting        _ViewSetting;                                      // 0x0030(0x0014)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F52[0x3C];                                    // 0x0044(0x003C)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FocusDriver_Forward">();
	}
	static class UFocusDriver_Forward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFocusDriver_Forward>();
	}
};
static_assert(alignof(UFocusDriver_Forward) == 0x000008, "Wrong alignment on UFocusDriver_Forward");
static_assert(sizeof(UFocusDriver_Forward) == 0x000080, "Wrong size on UFocusDriver_Forward");
static_assert(offsetof(UFocusDriver_Forward, _ViewSetting) == 0x000030, "Member 'UFocusDriver_Forward::_ViewSetting' has a wrong offset!");

// Class Stigma.BT_V3_BuyBuff
// 0x0058 (0x00C8 - 0x0070)
class UBT_V3_BuyBuff final : public UBTTaskNode
{
public:
	EBTNodeResult                                 Result;                                            // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F53[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-69 ])
	TSet<struct FItemIDRef_Buff>                  Buffs;                                             // 0x0078(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BT_V3_BuyBuff">();
	}
	static class UBT_V3_BuyBuff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBT_V3_BuyBuff>();
	}
};
static_assert(alignof(UBT_V3_BuyBuff) == 0x000008, "Wrong alignment on UBT_V3_BuyBuff");
static_assert(sizeof(UBT_V3_BuyBuff) == 0x0000C8, "Wrong size on UBT_V3_BuyBuff");
static_assert(offsetof(UBT_V3_BuyBuff, Result) == 0x000070, "Member 'UBT_V3_BuyBuff::Result' has a wrong offset!");
static_assert(offsetof(UBT_V3_BuyBuff, Buffs) == 0x000078, "Member 'UBT_V3_BuyBuff::Buffs' has a wrong offset!");

// Class Stigma.ActionNotify
// 0x0010 (0x0040 - 0x0030)
class UActionNotify final : public UAnimNotifyState
{
public:
	EMoveMode                                     MoveMode;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F54[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-69 ])
	float                                         RotationYawRate;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECameraWalkMode                               CameraWalk;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESideViewSide                                 CameraWalkSide;                                    // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F55[0x6];                                     // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionNotify">();
	}
	static class UActionNotify* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionNotify>();
	}
};
static_assert(alignof(UActionNotify) == 0x000008, "Wrong alignment on UActionNotify");
static_assert(sizeof(UActionNotify) == 0x000040, "Wrong size on UActionNotify");
static_assert(offsetof(UActionNotify, MoveMode) == 0x000030, "Member 'UActionNotify::MoveMode' has a wrong offset!");
static_assert(offsetof(UActionNotify, RotationYawRate) == 0x000034, "Member 'UActionNotify::RotationYawRate' has a wrong offset!");
static_assert(offsetof(UActionNotify, CameraWalk) == 0x000038, "Member 'UActionNotify::CameraWalk' has a wrong offset!");
static_assert(offsetof(UActionNotify, CameraWalkSide) == 0x000039, "Member 'UActionNotify::CameraWalkSide' has a wrong offset!");

// Class Stigma.UI_BattlePassLevelUpPopup
// 0x0000 (0x0570 - 0x0570)
class UUI_BattlePassLevelUpPopup : public UPopupBase
{
public:
	void InitWidget(const class FText& _Title, int32 _level);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI_BattlePassLevelUpPopup">();
	}
	static class UUI_BattlePassLevelUpPopup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_BattlePassLevelUpPopup>();
	}
};
static_assert(alignof(UUI_BattlePassLevelUpPopup) == 0x000008, "Wrong alignment on UUI_BattlePassLevelUpPopup");
static_assert(sizeof(UUI_BattlePassLevelUpPopup) == 0x000570, "Wrong size on UUI_BattlePassLevelUpPopup");

// Class Stigma.StigmaAIControllerBase
// 0x0020 (0x03E0 - 0x03C0)
class AStigmaAIControllerBase : public AAIController
{
public:
	uint8                                         Pad_1F57[0x20];                                    // 0x03C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	bool OnSERVER_Died(const struct FHitData& _last_hit_data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StigmaAIControllerBase">();
	}
	static class AStigmaAIControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStigmaAIControllerBase>();
	}
};
static_assert(alignof(AStigmaAIControllerBase) == 0x000008, "Wrong alignment on AStigmaAIControllerBase");
static_assert(sizeof(AStigmaAIControllerBase) == 0x0003E0, "Wrong size on AStigmaAIControllerBase");

// Class Stigma.AutoBoosterTrigger
// 0x0188 (0x01B0 - 0x0028)
class UAutoBoosterTrigger : public UObject
{
public:
	uint8                                         Pad_1F59[0x188];                                   // 0x0028(0x0188)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoBoosterTrigger">();
	}
	static class UAutoBoosterTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoBoosterTrigger>();
	}
};
static_assert(alignof(UAutoBoosterTrigger) == 0x000008, "Wrong alignment on UAutoBoosterTrigger");
static_assert(sizeof(UAutoBoosterTrigger) == 0x0001B0, "Wrong size on UAutoBoosterTrigger");

// Class Stigma.AutoBooster_AntiStun
// 0x0000 (0x01B0 - 0x01B0)
class UAutoBooster_AntiStun final : public UAutoBoosterTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoBooster_AntiStun">();
	}
	static class UAutoBooster_AntiStun* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoBooster_AntiStun>();
	}
};
static_assert(alignof(UAutoBooster_AntiStun) == 0x000008, "Wrong alignment on UAutoBooster_AntiStun");
static_assert(sizeof(UAutoBooster_AntiStun) == 0x0001B0, "Wrong size on UAutoBooster_AntiStun");

// Class Stigma.AdvancedAIController
// 0x02F8 (0x06D8 - 0x03E0)
class AAdvancedAIController : public AStigmaAIControllerBase
{
public:
	float                                         TimeToLostSight;                                   // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeToForget;                                      // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EAI_Tactics, struct FAI_Patterns>        _TacticalPatterns;                                 // 0x03E8(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class ACharaBase*                             _TargetEnemy;                                      // 0x0438(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACharaBase*                             _TargetAlly;                                       // 0x0440(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5A[0x48];                                    // 0x0448(0x0048)(Fixing Size After Last Property [ Dumper-69 ])
	TMap<class AActor*, struct FRecognizedActor>  _RecognizedActors;                                 // 0x0490(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5B[0x18];                                    // 0x04E0(0x0018)(Fixing Size After Last Property [ Dumper-69 ])
	TMap<EAIFocusMode, struct FFocusDrivers>      _FocusDrivers;                                     // 0x04F8(0x0050)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UFocusDriver*                           _FocusDriver;                                      // 0x0548(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5C[0x18];                                    // 0x0550(0x0018)(Fixing Size After Last Property [ Dumper-69 ])
	struct FGlobalAISetting                       _GlobalConfig;                                     // 0x0568(0x0044)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5D[0x5C];                                    // 0x05AC(0x005C)(Fixing Size After Last Property [ Dumper-69 ])
	TArray<class AAIRoamingPointVolume*>          _Waypoints;                                        // 0x0608(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F5E[0xC0];                                    // 0x0618(0x00C0)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static struct FAI_Characteristic MakeCharacteristic(int32 _elo, float _coward, float _shooting_oriented);

	void BoostTargetEnemy(class ACharaBase* _enemy);
	void OnTargetPerceptionForgotten(class AActor* _target);
	void OnTargetPerceptionUpdated(class AActor* _target, const struct FAIStimulus& _stimulus);
	void Setup(EAIRole _role, int32 _elo, float _coward, float _shooting_oriented);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdvancedAIController">();
	}
	static class AAdvancedAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAdvancedAIController>();
	}
};
static_assert(alignof(AAdvancedAIController) == 0x000008, "Wrong alignment on AAdvancedAIController");
static_assert(sizeof(AAdvancedAIController) == 0x0006D8, "Wrong size on AAdvancedAIController");
static_assert(offsetof(AAdvancedAIController, TimeToLostSight) == 0x0003E0, "Member 'AAdvancedAIController::TimeToLostSight' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, TimeToForget) == 0x0003E4, "Member 'AAdvancedAIController::TimeToForget' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _TacticalPatterns) == 0x0003E8, "Member 'AAdvancedAIController::_TacticalPatterns' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _TargetEnemy) == 0x000438, "Member 'AAdvancedAIController::_TargetEnemy' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _TargetAlly) == 0x000440, "Member 'AAdvancedAIController::_TargetAlly' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _RecognizedActors) == 0x000490, "Member 'AAdvancedAIController::_RecognizedActors' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _FocusDrivers) == 0x0004F8, "Member 'AAdvancedAIController::_FocusDrivers' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _FocusDriver) == 0x000548, "Member 'AAdvancedAIController::_FocusDriver' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _GlobalConfig) == 0x000568, "Member 'AAdvancedAIController::_GlobalConfig' has a wrong offset!");
static_assert(offsetof(AAdvancedAIController, _Waypoints) == 0x000608, "Member 'AAdvancedAIController::_Waypoints' has a wrong offset!");

// Class Stigma.AdvancedBlueprintMapLibrary
// 0x0000 (0x0028 - 0x0028)
class UAdvancedBlueprintMapLibrary final : public UBlueprintMapLibrary
{
public:
	static void Map_KeyValue(const TMap<int32, int32>& _target_map, const int32 _index, int32* _out_Key, int32* _out_value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AdvancedBlueprintMapLibrary">();
	}
	static class UAdvancedBlueprintMapLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAdvancedBlueprintMapLibrary>();
	}
};
static_assert(alignof(UAdvancedBlueprintMapLibrary) == 0x000008, "Wrong alignment on UAdvancedBlueprintMapLibrary");
static_assert(sizeof(UAdvancedBlueprintMapLibrary) == 0x000028, "Wrong size on UAdvancedBlueprintMapLibrary");

// Class Stigma.BT_V3_DrawDebugShape
// 0x0040 (0x00B0 - 0x0070)
class UBT_V3_DrawDebugShape final : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                 BlackboardKey;                                     // 0x0070(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Lifetime;                                          // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBTNodeResult                                 Result;                                            // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F61[0x7];                                     // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-69 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BT_V3_DrawDebugShape">();
	}
